{
  "OCGA 16-3-21": {
    "section": "16-3-21",
    "heading": "Use of force in defense of self or others; evidence of belief that force was necessary in murder or manslaughter prosecution",
    "text": "16-3-21. Use of force in defense of self or others; evidence of belief that force was necessary in murder or manslaughter prosecution.\nA person is justified in threatening or using force against another when and to the extent that he or she reasonably believes that such threat or force is necessary to defend himself or herself or a third person against such other's imminent use of unlawful force; however, except as provided in Code Section 16-3-23, a person is justified in using force which is intended or likely to cause death or great bodily harm only if he or she reasonably believes that such force is necessary to prevent death or great bodily injury to himself or herself or a third person or to prevent the commission of a forcible felony.\nA person is not justified in using force under the circumstances specified in subsection (a) of this Code section if he:\nInitially provokes the use of force against himself with the intent to use such force as an excuse to inflict bodily harm upon the assailant;\nIs attempting to commit, committing, or fleeing after the commission or attempted commission of a felony; or\nWas the aggressor or was engaged in a combat by agreement unless he withdraws from the encounter and effectively communicates to such other person his intent to do so and the other, notwithstanding, continues or threatens to continue the use of unlawful force.\nAny rule, regulation, or policy of any agency of the state or any ordinance, resolution, rule, regulation, or policy of any county, municipality, or other political subdivision of the state which is in conflict with this Code section shall be null, void, and of no force and effect.\nIn a prosecution for murder or manslaughter, if a defendant raises as a defense a justification provided by subsection (a) of this Code section, the defendant, in order to establish the defendant's reasonable belief that the use of force or deadly force was immediately necessary, may be permitted to offer:\nRelevant evidence that the defendant had been the victim of acts of family violence or child abuse committed by the deceased, as such acts are described in Code Sections 19-13-1 and 19-15-1, respectively; and\nRelevant expert testimony regarding the condition of the mind of the defendant at the time of the offense, including those relevant facts and circumstances relating to the family violence or child abuse that are the bases of the expert's opinion.\n(Laws 1833, Cobb's 1851 Digest, p. 785; Code 1863, § 4230; Code 1868, § 4267; Code 1873, § 4333; Code 1882, § 4333; Penal Code 1895, § 73; Penal Code 1910, § 73; Code 1933, § 26-1014; Code 1933, § 26-902, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1975, p. 1209, § 1; Ga. L. 1993, p. 1716, § 2; Ga. L. 2001, p. 1247, § 1.)",
    "text_length": 2756,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-3-23.1": {
    "section": "16-3-23.1",
    "heading": "No duty to retreat prior to use of force in self-defense",
    "text": "16-3-23.1. No duty to retreat prior to use of force in self-defense.\nA person who uses threats or force in accordance with Code Section 16-3-21, relating to the use of force in defense of self or others, Code Section 16-3-23, relating to the use of force in defense of a habitation, or Code Section 16-3-24, relating to the use of force in defense of property other than a habitation, has no duty to retreat and has the right to stand his or her ground and use force as provided in said Code sections, including deadly force.\n(Code 1981, §\n16-3-23.1\n, enacted by Ga. L. 2006, p. 477, § 1/SB 396.)",
    "text_length": 596,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-20": {
    "section": "16-5-20",
    "heading": "Simple assault",
    "text": "16-5-20. Simple assault.\nA person commits the offense of simple assault when he or she either:\nAttempts to commit a violent injury to the person of another; or\nCommits an act which places another in reasonable apprehension of immediately receiving a violent injury.\nExcept as provided in subsections (c) through (h) of this Code section, a person who commits the offense of simple assault shall be guilty of a misdemeanor.\nAny person who commits the offense of simple assault in a public transit vehicle or station shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, \"public transit vehicle\" means a bus, van, or rail car used for the transportation of passengers within a system which receives a subsidy from tax revenues or is operated under a franchise contract with a county or municipality of this state.\nIf the offense of simple assault is committed between past or present spouses, persons who are parents of the same child, parents and children, stepparents and stepchildren, foster parents and foster children, or other persons excluding siblings living or formerly living in the same household, the defendant shall be punished for a misdemeanor of a high and aggravated nature. In no event shall this subsection be applicable to corporal punishment administered by a parent or guardian to a child or administered by a person acting in loco parentis.\nAny person who commits the offense of simple assault against a person who is 65 years of age or older shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\nAny person who commits the offense of simple assault against an employee of a public school system of this state while such employee is engaged in official duties or on school property shall, upon conviction of such offense, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, \"school property\" shall include public school buses and stops for public school buses as designated by local school boards of education.\nAny person who commits the offense of simple assault against a female who is pregnant at the time of the offense shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\nNothing in this Code section shall be construed to permit the prosecution of:\nAny person for conduct relating to an abortion for which the consent of the pregnant woman, or person authorized by law to act on her behalf, has been obtained or for which such consent is implied by law;\nAny person for any medical treatment of the pregnant woman or her unborn child; or\nAny woman with respect to her unborn child.\nFor the purposes of this subsection, the term \"unborn child\" means a member of the species homo sapiens at any stage of development who is carried in the womb.\n(Laws 1833, Cobb's 1851 Digest, p. 787; Code 1863, §§ 4256, 4257; Code 1868, §§ 4291, 4292; Code 1873, §§ 4357, 4358; Code 1882, §§ 4357, 4358; Penal Code 1895, §§ 95, 96; Penal Code 1910, §§ 95, 96; Code 1933, §§ 26-1401, 26-1402; Code 1933, § 26-1301, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1991, p. 971, §§ 1, 2; Ga. L. 1999, p. 381, § 2; Ga. L. 1999, p. 562, § 2; Ga. L. 2004, p. 621, § 1; Ga. L. 2005, p. 60, § 16/HB 95; Ga. L. 2006, p. 643, § 1/SB 77.)\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1999, \"subsections (c), (d), and (e)\" was substituted for \"subsections (c) and (d)\" in subsection (b), and subsection (d) as enacted by Ga. L. 1999, p. 562,\n§\n2, was redesignated as subsection (e).",
    "text_length": 3596,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-21": {
    "section": "16-5-21",
    "heading": "Aggravated assault",
    "text": "16-5-21. Aggravated assault.\nA person commits the offense of aggravated assault when he or she assaults:\nWith intent to murder, to rape, or to rob;\nWith a deadly weapon or with any object, device, or instrument which, when used offensively against a person, is likely to or actually does result in serious bodily injury;\nWith any object, device, or instrument which, when used offensively against a person, is likely to or actually does result in strangulation; or\nA person or persons without legal justification by discharging a firearm from within a motor vehicle toward a person or persons.\nExcept as provided in subsections (c) through (k) of this Code section, a person convicted of the offense of aggravated assault shall be punished by imprisonment for not less than one nor more than 20 years.\nA person who knowingly commits the offense of aggravated assault upon a public safety officer while he or she is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished as follows:\nWhen such assault occurs by the discharge of a firearm by a person who is at least 17 years of age, such person shall be punished by imprisonment for not less than ten nor more than 20 years and shall be sentenced to a mandatory minimum term of imprisonment of ten years and no portion of the mandatory minimum sentence imposed shall be suspended, stayed, probated, deferred, or withheld by the sentencing court; provided, however, that in the court's discretion, the court may depart from such mandatory minimum sentence when the prosecuting attorney and defendant have agreed to a sentence that is below such mandatory minimum;\nWhen such assault does not involve the discharge of a firearm by a person who is at least 17 years of age, and does not involve only the use of the person's body, such person shall be punished by imprisonment for not less than five nor more than 20 years and, for persons who are at least 17 years of age, shall be sentenced to a mandatory minimum term of imprisonment of three years and no portion of the mandatory minimum sentence imposed shall be suspended, stayed, probated, deferred, or withheld by the sentencing court; provided, however, that in the court's discretion, the court may depart from such mandatory minimum sentence when the prosecuting attorney and defendant have agreed to a sentence that is below such mandatory minimum; or\nWhen such assault occurs only involving the use of the person's body, by imprisonment for not less than five nor more than 20 years.\nA person convicted under this subsection shall be punished, in addition to any term of imprisonment imposed, by a fine as provided by law which shall be at least $2,000.00. With respect to $2,000.00 of the fine imposed, after distributing the surcharges and deductions required by Chapter 21 of Title 15, Code Sections 36-15-9 and 42-8-34, and Title 47, it shall be earmarked for the Georgia State Indemnification Fund for purposes of payment of indemnification for death or disability as provided for in Part 1 of Article 5 of Chapter 9 of Title 45.\nAs used in this subsection, the term \"firearm\" means any handgun, rifle, shotgun, or similar device or weapon which will or can be converted to expel a projectile by the action of an explosive or electrical charge.\nAny person who commits the offense of aggravated assault against a person who is 65 years of age or older shall, upon conviction thereof, be punished by imprisonment for not less than three nor more than 20 years.\nAny person who commits the offense of aggravated assault in a public transit vehicle or station shall, upon conviction thereof, be punished by imprisonment for not less than three nor more than 20 years.\nAny person who commits the offense of aggravated assault upon a person in the course of violating Code Section 16-8-2 where the property that was the subject of the theft was a vehicle engaged in commercial transportation of cargo or any appurtenance thereto, including without limitation any such trailer, semitrailer, container, or other associated equipment, or the cargo being transported therein or thereon, shall upon conviction be punished by imprisonment for not less than five nor more than 20 years, a fine not less than $50,000.00 nor more than $200,000.00, or both such fine and imprisonment. For purposes of this subsection, the term \"vehicle\" includes without limitation any railcar.\nExcept as provided in subsection (c) of this Code section, a person convicted of an offense described in paragraph (4) of subsection (a) of this Code section shall be punished by imprisonment for not less than five nor more than 20 years.\nAny person who commits the offense of aggravated assault involving the use of a firearm upon a student or teacher or other school personnel within a school safety zone as defined in Code Section 16-11-127.1 shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\nIf the offense of aggravated assault is committed between past or present spouses, persons who are parents of the same child, parents and children, stepparents and stepchildren, foster parents and foster children, or other persons excluding siblings living or formerly living in the same household, the defendant shall be punished by imprisonment for not less than three nor more than 20 years.\nAny person who commits the offense of aggravated assault with intent to rape against a child under the age of 14 years shall be punished by imprisonment for not less than 25 nor more than 50 years. Any person convicted under this subsection shall, in addition, be subject to the sentencing and punishment provisions of Code Section 17-10-6.2.\nA person who knowingly commits the offense of aggravated assault upon an officer of the court while such officer is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\n(Laws 1833, Cobb's 1851 Digest, pp. 787-789; Laws 1840, Cobb's 1851 Digest, p. 788; Code 1863, §§ 4250, 4258, 4259, 4260; Ga. L. 1866, p. 151, § 1; Code 1868, §§ 4285, 4293, 4294, 4295; Code 1873, §§ 4351, 4359, 4360, 4361; Code 1882, §§ 4351, 4359, 4360, 4361; Penal Code 1895, §§ 97, 98, 99, 100; Penal Code 1910, §§ 97, 98, 99, 100; Code 1933, §§ 26-1403, 26-1404, 26-1405, 26-1406; Code 1933, § 26-1302, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1976, p. 543, § 1; Ga. L. 1982, p. 1242, § 2; Ga. L. 1984, p. 900, § 1; Ga. L. 1985, p. 628, § 1; Ga. L. 1991, p. 971, §§ 3, 4; Ga. L. 1994, p. 1012, § 8; Ga. L. 1994, p. 1920, §§ 1, 2; Ga. L. 1996, p. 988, § 1; Ga. L. 1997, p. 1453, § 1; Ga. L. 1999, p. 381, § 3; Ga. L. 2000, p. 1626, § 1; Ga. L. 2003, p. 140, § 16; Ga. L. 2004, p. 1072, § 1; Ga. L. 2006, p. 379, § 4/HB 1059; Ga. L. 2010, p. 999, § 1/HB 1002; Ga. L. 2011, p. 752, § 16/HB 142; Ga. L. 2014, p. 432, § 2-2/HB 826; Ga. L. 2014, p. 441, § 1/HB 911; Ga. L. 2014, p. 599, § 3-1/HB 60; Ga. L. 2015, p. 422, § 5-19/HB 310; Ga. L. 2016, p. 582, § 1/HB 979; Ga. L. 2017, p. 500, § 3-2/SB 160.)\nThe 2017 amendment,\neffective July 1, 2017, deleted subsection (a), which read: \"As used in this Code section, the term 'strangulation' means impeding the normal breathing or circulation of blood of another person by applying pressure to the throat or neck of such person or by obstructing the nose and mouth of such person.\"; redesignated former subsections (b) and (c) as present subsections (a) and (b), respectively; substituted \"subsections (c) through (k)\" for \"subsections (d) through (n)\" in subsection (b); redesignated former subsections (d) and (e) as present subsections (c) and (d), respectively; rewrote present subsection (c); deleted former subsection (f), relating to defining the term \"correctional officer\"; redesignated former subsection (g) as present subsection (e); deleted the second sentence of subsection (e), which read: \"For purposes of this Code section, 'public transit vehicle' has the same meaning as in subsection (c) of Code Section 16-5-20.\"; redesignated former subsections (h) and (i) as present subsections (f) and (g), respectively; in subsection (g), substituted \"Except as provided in subsection (c) of this Code section, a\" for \"A\" at the beginning, and substituted \"subsection (a)\" for \"subsection (b)\" in the middle; redesignated former subsections (j) through (m) as present subsections (h) through (k), respectively; deleted the former second sentence in subsection (k), which read: \"As used in this subsection, the term 'officer of the court' means a judge, attorney, clerk of court, deputy clerk of court, court reporter, court interpreter, community supervision officer, county or Department of Juvenile Justice juvenile probation officer, or probation officer serving pursuant to Article 6 of Chapter 8 of Title 42.\"; and deleted former subsection (n), which read: \"A person who knowingly commits the offense of aggravated assault upon an emergency health worker while the worker is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years. As used in this subsection, the term 'emergency health worker\" means hospital emergency department personnel and emergency medical services personnel.\".\nCross references.\n- Indemnification program for law enforcement officers, firefighters, and prison guards killed or injured on duty,\n§\n45-9-80\net seq.\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1994, since both Ga. L. 1994, p. 1012 and p. 1920 enacted a new subsection (g), the amendment by Ga. L. 1994, p. 1012 has been redesignated as subsection (h).",
    "text_length": 9775,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-23": {
    "section": "16-5-23",
    "heading": "Simple battery",
    "text": "16-5-23. Simple battery.\nA person commits the offense of simple battery when he or she either:\nIntentionally makes physical contact of an insulting or provoking nature with the person of another; or\nIntentionally causes physical harm to another.\nExcept as otherwise provided in subsections (c) through (i) of this Code section, a person convicted of the offense of simple battery shall be punished as for a misdemeanor.\nAny person who commits the offense of simple battery against a person who is 65 years of age or older or against a female who is pregnant at the time of the offense shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\nAny person who commits the offense of simple battery in a public transit vehicle or station shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, \"public transit vehicle\" has the same meaning as in subsection (c) of Code Section 16-5-20.\nAny person who commits the offense of simple battery against a police officer, correction officer, or detention officer engaged in carrying out official duties shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\nIf the offense of simple battery is committed between past or present spouses, persons who are parents of the same child, parents and children, stepparents and stepchildren, foster parents and foster children, or other persons excluding siblings living or formerly living in the same household, the defendant shall be punished for a misdemeanor of a high and aggravated nature. In no event shall this subsection be applicable to corporal punishment administered by a parent or guardian to a child or administered by a person acting in loco parentis.\nA person who is an employee, agent, or volunteer at any facility licensed or required to be licensed under Code Section 31-7-3, relating to long-term care facilities, or Code Section 31-7-12.2, relating to assisted living communities, or Code Section 31-7-12, relating to personal care homes, or who is required to be licensed pursuant to Code Section 31-7-151 or 31-7-173, relating to home health care and hospices, who commits the offense of simple battery against a person who is admitted to or receiving services from such facility, person, or entity shall be punished for a misdemeanor of a high and aggravated nature.\nAny person who commits the offense of simple battery against a sports official while such sports official is officiating an amateur contest or while such sports official is on or exiting the property where he or she will officiate or has completed officiating an amateur contest shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature. For the purposes of this Code section, the term \"sports official\" means any person who officiates, umpires, or referees an amateur contest at the collegiate, elementary or secondary school, or recreational level.\nAny person who commits the offense of simple battery against an employee of a public school system of this state while such employee is engaged in official duties or on school property shall, upon conviction of such offense, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, \"school property\" shall include public school buses and stops for public school buses as designated by local school boards of education.\n(Laws 1833, Cobb's 1851 Digest, p. 788; Code 1863, § 4262; Code 1868, § 4297; Code 1873, § 4363; Code 1882, § 4363; Penal Code 1895, § 102; Penal Code 1910, § 102; Code 1933, § 26-1408; Code 1933, § 26-1304, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1987, p. 557, § 1; Ga. L. 1991, p. 971, §§ 5, 6; Ga. L. 1992, p. 2055, § 1; Ga. L. 1993, p. 91, § 16; Ga. L. 1997, p. 907, § 1; Ga. L. 1999, p. 381, § 4; Ga. L. 1999, p. 562, § 3; Ga. L. 2000, p. 16, § 1; Ga. L. 2004, p. 621, § 2; Ga. L. 2005, p. 60, § 16/HB 95; Ga. L. 2011, p. 227, § 3/SB 178; Ga. L. 2015, p. 203, § 3-2/SB 72.)\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1992, subsection (d) as added by Ga. L. 1992, p. 2066,\n§\n1, was redesignated as subsection (e), since this Code section already had a subsection (d).",
    "text_length": 4264,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-23.1": {
    "section": "16-5-23.1",
    "heading": "Battery",
    "text": "16-5-23.1. Battery.\nA person commits the offense of battery when he or she intentionally causes substantial physical harm or visible bodily harm to another.\nAs used in this Code section, the term \"visible bodily harm\" means bodily harm capable of being perceived by a person other than the victim and may include, but is not limited to, substantially blackened eyes, substantially swollen lips or other facial or body parts, or substantial bruises to body parts.\nExcept as provided in subsections (d) through (k) of this Code section, a person who commits the offense of battery is guilty of a misdemeanor.\nUpon the second conviction for battery against the same victim, the defendant shall be punished by imprisonment for not less than ten days nor more than 12 months, by a fine not to exceed $1,000.00, or both. The minimum sentence of ten days for a second offense shall not be suspended, probated, deferred, stayed, or withheld; provided, however, that it is within the authority and discretion of the sentencing judge to:\nAllow the sentence to be served on weekends by weekend confinement or during the nonworking hours of the defendant. A weekend shall commence and shall end in the discretion of the sentencing judge, and the nonworking hours of the defendant shall be determined in the discretion of the sentencing judge; or\nSuspend, probate, defer, stay, or withhold the minimum sentence where there exists clear and convincing evidence that imposition of the minimum sentence would either create an undue hardship upon the defendant or result in a failure of justice.\nUpon a third or subsequent conviction for battery against the same victim, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than five years. The minimum sentence provisions contained in subsection (d) of this Code section shall apply to sentences imposed pursuant to this subsection.\nAs used in this subsection, the term \"household member\" means past or present spouses, persons who are parents of the same child, parents and children, stepparents and stepchildren, foster parents and foster children, or other persons living or formerly living in the same household.\nIf the offense of battery is committed between household members, it shall constitute the offense of family violence battery and shall be punished as follows:\nUpon a first conviction of family violence battery, the defendant shall be guilty of and punished for a misdemeanor; provided, however, that if the defendant has previously been convicted of a forcible felony committed between household members under the laws of this state, of the United States, including the laws of its territories, possessions, or dominions, or any of the several states, or of any foreign nation recognized by the United States, which if committed in this state would have constituted a forcible felony committed between household members, he or she shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than five years; and\nUpon a second or subsequent conviction of family violence battery against the same or another victim, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than five years.\nIn no event shall this subsection be applicable to reasonable corporal punishment administered by parent to child.\nAny person who commits the offense of battery in a public transit vehicle or station shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, \"public transit vehicle\" has the same meaning as in subsection (c) of Code Section 16-5-20.\nAny person who commits the offense of battery against a female who is pregnant at the time of the offense shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\nAny person who commits the offense of battery against a teacher or other school personnel engaged in the performance of official duties or while on school property shall, upon conviction thereof, be punished by imprisonment for not less than one nor more than five years or a fine of not more than $10,000.00, or both. For purposes of this Code section, \"school property\" shall include public school buses and public school bus stops as designated by local school boards of education.\nA person who is an employee, agent, or volunteer at any facility licensed or required to be licensed under Code Section 31-7-3, relating to long-term care facilities, or Code Section 31-7-12.2, relating to assisted living communities, or Code Section 31-7-12, relating to personal care homes, or who is required to be licensed pursuant to Code Section 31-7-151 or 31-7-173, relating to home health care and hospices, who commits the offense of battery against a person who is admitted to or receiving services from such facility, person, or entity shall, upon conviction thereof, be punished by imprisonment for not less than one nor more than five years, or a fine of not more than $2,000.00, or both.\nAny person who commits the offense of battery against a sports official while such sports official is officiating an amateur contest or while such sports official is on or exiting the property where he or she will officiate or has completed officiating an amateur contest shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature. For purposes of this Code section, the term \"sports official\" means any person who officiates, umpires, or referees an amateur contest at the collegiate, elementary or secondary school, or recreational level.\n(Code 1981, §\n16-5-23.1\n, enacted by Ga. L. 1987, p. 1010, § 1; Ga. L. 1991, p. 971, §§ 7, 8; Ga. L. 1996, p. 449, § 1; Ga. L. 1997, p. 907, § 2; Ga. L. 1997, p. 1064, § 9; Ga. L. 1998, p. 128, § 16; Ga. L. 1999, p. 562, § 4; Ga. L. 2000, p. 16, § 1; Ga. L. 2004, p. 621, § 3; Ga. L. 2011, p. 227, § 4/SB 178; Ga. L. 2016, p. 587, § 1/SB 193; Ga. L. 2019, p. 81, § 1/HB 424.)\nThe 2019 amendment,\neffective April 18, 2019, substituted \"(k)\" for \"(l)\" in subsection (c); deleted former subsection (j), which read: \"Except as otherwise provided in subsection (e) and paragraph (2) of subsection (f) of this Code section, any person who commits the offense of battery against a person who is 65 years of age or older shall, upon conviction thereof, be punished for a misdemeanor of a high and aggravated nature.\"; and redesignated former subsections (k) and (l) as present subsections (j) and (k), respectively.\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1987, a comma was inserted following \"stay\" in paragraph (d)(2).\nPursuant to Code Section 28-9-5, in 1997, subsection (h), which was added by Ga. L. 1997, p. 1064, was redesignated as subsection (i).",
    "text_length": 6843,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-24": {
    "section": "16-5-24",
    "heading": "Aggravated battery",
    "text": "16-5-24. Aggravated battery.\nA person commits the offense of aggravated battery when he or she maliciously causes bodily harm to another by depriving him or her of a member of his or her body, by rendering a member of his or her body useless, or by seriously disfiguring his or her body or a member thereof.\nExcept as provided in subsections (c) through (g) of this Code section, a person convicted of the offense of aggravated battery shall be punished by imprisonment for not less than one nor more than 20 years.\nA person who knowingly commits the offense of aggravated battery upon a public safety officer while the public safety officer is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished by imprisonment for not less than ten nor more than 20 years; provided, however, that for persons who are at least 17 years of age, a mandatory minimum term of imprisonment of three years shall be imposed and no portion of the mandatory minimum sentence shall be suspended, stayed, probated, deferred, or otherwise withheld by the sentencing court; provided, however, that in the court's discretion, the court may depart from such mandatory minimum sentence when the prosecuting attorney and defendant have agreed to a sentence that is below such mandatory minimum.\nA person convicted under this subsection shall be punished, in addition to any term of imprisonment imposed, by a fine as provided by law which shall be at least $2,000.00. With respect to $2,000.00 of the fine imposed, after distributing the surcharges and deductions required by Chapter 21 of Title 15, Code Sections 36-15-9 and 42-8-34, and Title 47, it shall be earmarked for the Georgia State Indemnification Fund for purposes of payment of indemnification for death or disability as provided for in Part 1 of Article 5 of Chapter 9 of Title 45.\nAny person who commits the offense of aggravated battery against a person who is 65 years of age or older shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\nAny person who commits the offense of aggravated battery in a public transit vehicle or station shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\nAny person who commits the offense of aggravated battery upon a student or teacher or other school personnel within a school safety zone as defined in Code Section 16-11-127.1 shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\nIf the offense of aggravated battery is committed between past or present spouses, persons who are parents of the same child, parents and children, stepparents and stepchildren, foster parents and foster children, or other persons excluding siblings living or formerly living in the same household, the defendant shall be punished by imprisonment for not less than three nor more than 20 years.\n(Laws 1833, Cobb's 1851 Digest, pp. 786, 787; Code 1863, § 4238; Code 1868, § 4273; Code 1873, § 4339; Code 1882, § 4339; Penal Code 1895, § 83; Penal Code 1910, § 83; Code 1933, § 26-1201; Code 1933, § 26-1305, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1976, p. 543, § 2; Ga. L. 1982, p. 3, § 16; Ga. L. 1984, p. 900, § 2; Ga. L. 1985, p. 628, § 2; Ga. L. 1991, p. 971, §§ 9, 10; Ga. L. 1994, p. 1012, § 9; Ga. L. 1996, p. 988, § 2; Ga. L. 1997, p. 1453, § 1; Ga. L. 1999, p. 381, § 5; Ga. L. 2000, p. 1626, § 2; Ga. L. 2003, p. 140, § 16; Ga. L. 2014, p. 432, § 2-3/HB 826; Ga. L. 2014, p. 599, § 3-2/HB 60; Ga. L. 2016, p. 582, § 2/HB 979; Ga. L. 2017, p. 500, § 3-3/SB 160.)\nThe 2017 amendment,\neffective July 1, 2017, substituted \"subsections (c) through (g)\" for \"subsections (c) through (i)\" in subsection (b); designated the existing provisions of subsection (c) as paragraph (c)(1); in paragraph (c)(1), substituted \"public safety officer while the public safety officer\" for \"peace officer while the officer\" near the middle, added the proviso at the end; added paragraph (c)(2); deleted former subsection (e), which read: \"(1) As used in this subsection, the term 'correctional officer' shall include superintendents, wardens, deputy wardens, guards, and correctional officers of state, county, and municipal penal institutions who are certified by the Georgia Peace Officer Standards and Training Council pursuant to Chapter 8 of Title 35 and employees of the Department of Juvenile Justice who are known to be employees of the department or who have given reasonable identification of their employment. The term 'correctional officer' shall also include county jail officers who are certified or registered by the Georgia Peace Officer Standards and Training Council pursuant to Chapter 8 of Title 35.\"\n\"(2) A person who knowingly commits the offense of aggravated battery upon a correctional officer while the correctional officer is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished by imprisonment for not less than ten nor more than 20 years.\"; redesignated former subsection (f) as present subsection (e); deleted the second sentence in present subsection (e), which read: \"For purposes of this Code section, 'public transit vehicle' has the same meaning as in subsection (c) of Code Section 16-5-20.\"; redesignated former subsections (g) and (h) as present subsections (f) and (g), respectively; and deleted former subsection (i), which read: \"A person who knowingly commits the offense of aggravated battery upon an emergency health worker while the worker is engaged in, or on account of the performance of, his or her official duties shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years. As used in this subsection, the term 'emergency health worker' means hospital emergency department personnel and emergency medical services personnel.\"\nCross references.\n- Indemnification program for law enforcement officers, firefighters, and prison guards killed or injured on duty,\n§\n45-9-80\net seq.",
    "text_length": 6114,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-70": {
    "section": "16-5-70",
    "heading": "Cruelty to children",
    "text": "16-5-70. Cruelty to children.\nA parent, guardian, or other person supervising the welfare of or having immediate charge or custody of a child under the age of 18 commits the offense of cruelty to children in the first degree when such person willfully deprives the child of necessary sustenance to the extent that the child's health or well-being is jeopardized.\nAny person commits the offense of cruelty to children in the first degree when such person maliciously causes a child under the age of 18 cruel or excessive physical or mental pain.\nAny person commits the offense of cruelty to children in the second degree when such person with criminal negligence causes a child under the age of 18 cruel or excessive physical or mental pain.\nAny person commits the offense of cruelty to children in the third degree when:\nSuch person, who is the primary aggressor, intentionally allows a child under the age of 18 to witness the commission of a forcible felony, battery, or family violence battery; or\nSuch person, who is the primary aggressor, having knowledge that a child under the age of 18 is present and sees or hears the act, commits a forcible felony, battery, or family violence battery.\nA person convicted of the offense of cruelty to children in the first degree as provided in this Code section shall be punished by imprisonment for not less than five nor more than 20 years.\nA person convicted of the offense of cruelty to children in the second degree shall be punished by imprisonment for not less than one nor more than ten years.\nA person convicted of the offense of cruelty to children in the third degree shall be punished as for a misdemeanor upon the first or second conviction. Upon conviction of a third or subsequent offense of cruelty to children in the third degree, the defendant shall be guilty of a felony and shall be sentenced to a fine not less than $1,000.00 nor more than $5,000.00 or imprisonment for not less than one year nor more than three years or shall be sentenced to both fine and imprisonment.\n(Ga. L. 1878-79, p. 162, § 3; Code 1882, § 4612h; Penal Code 1895, § 708; Penal Code 1910, § 758; Code 1933, § 26-8001; Code 1933, § 26-2801, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1978, p. 228, § 1; Ga. L. 1981, p. 683, § 1; Ga. L. 1995, p. 957, § 2; Ga. L. 1996, p. 1071, § 1; Ga. L. 1999, p. 381, § 6; Ga. L. 2004, p. 57, § 3.)\nCross references.\n- Televising testimony of child who is victim of offense under subsection (b) of this Code section,\n§\n17-8-55\n.\nRequirements regarding reporting instances of child abuse,\n§\n19-7-5\n.\nAdministration of corporal punishment in schools,\n§§\n20-2-731\n,\n20-2-732\n.",
    "text_length": 2648,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-91": {
    "section": "16-5-91",
    "heading": "Aggravated stalking",
    "text": "16-5-91. Aggravated stalking.\nA person commits the offense of aggravated stalking when such person, in violation of a bond to keep the peace posted pursuant to Code Section 17-6-110, temporary restraining order, temporary protective order, permanent restraining order, permanent protective order, preliminary injunction, good behavior bond, or permanent injunction or condition of pretrial release, condition of probation, or condition of parole in effect prohibiting the behavior described in this subsection, follows, places under surveillance, or contacts another person at or about a place or places without the consent of the other person for the purpose of harassing and intimidating the other person.\nAny person convicted of a violation of subsection (a) of this Code section shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one nor more than ten years and by a fine of not more than $10,000.00. The provisions of subsection (d) of Code Section\n16-5-90\napply to sentencing for conviction of aggravated stalking.\n(Code 1981, §\n16-5-91\n, enacted by Ga. L. 1993, p. 1534, § 1; Ga. L. 1995, p. 911, § 1; Ga. L. 1998, p. 885, § 2; Ga. L. 2002, p. 862, § 1.)",
    "text_length": 1220,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-7-1": {
    "section": "16-7-1",
    "heading": "Burglary",
    "text": "16-7-1. Burglary.\nAs used in this Code section, the term:\n\"Dwelling\" means any building, structure, or portion thereof which is designed or intended for occupancy for residential use.\n\"Railroad car\" shall also include trailers on flatcars, containers on flatcars, trailers on railroad property, or containers on railroad property.\nA person commits the offense of burglary in the first degree when, without authority and with the intent to commit a felony or theft therein, he or she enters or remains within an occupied, unoccupied, or vacant dwelling house of another or any building, vehicle, railroad car, watercraft, aircraft, or other such structure designed for use as the dwelling of another. A person who commits the offense of burglary in the first degree shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one nor more than 20 years. Upon the second conviction for burglary in the first degree, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than two nor more than 20 years. Upon the third and all subsequent convictions for burglary in the first degree, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than five nor more than 25 years.\nA person commits the offense of burglary in the second degree when, without authority and with the intent to commit a felony or theft therein, he or she enters or remains within an occupied, unoccupied, or vacant building, structure, railroad car, watercraft, or aircraft. A person who commits the offense of burglary in the second degree shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one nor more than five years. Upon the second and all subsequent convictions for burglary in the second degree, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than eight years.\nUpon a fourth and all subsequent convictions for a crime of burglary in any degree, adjudication of guilt or imposition of sentence shall not be suspended, probated, deferred, or withheld.\n(Laws 1833, Cobb's 1851 Digest, p. 790; Ga. L. 1858, p. 98, § 1; Code 1863, §§ 4283, 4285; Ga. L. 1865-66, p. 232, § 2; Ga. L. 1866, p. 151, § 1; Ga. L. 1868, p. 16, § 1; Code 1868, §§ 4320, 4322; Code 1873, §§ 4386, 4388; Ga. L. 1878-79, p. 65, §§ 1, 2; Code 1882, §§ 4386, 4388; Penal Code 1895, §§ 149, 150; Penal Code 1910, §§ 146, 147; Code 1933, §§ 26-2401, 26-2402; Code 1933, § 26-1601, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1977, p. 895, § 1; Ga. L. 1978, p. 236, § 1; Ga. L. 1980, p. 770, § 1; Ga. L. 2012, p. 899, § 3-1/HB 1176; Ga. L. 2017, p. 417, § 1-2/SB 104.)\nThe 2017 amendment,\neffective July 1, 2017, deleted \"vehicle,\" following \"structure,\" near the end of the first sentence of subsection (c).\nCross references.\n- Entering motor vehicle with intent to commit theft or felony,\n§\n16-8-18\n.\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 2012, \"more than\" was substituted for \"more that\" in the next-to-last sentence of subsection (b).",
    "text_length": 3151,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-7-21": {
    "section": "16-7-21",
    "heading": "Criminal trespass",
    "text": "16-7-21. Criminal trespass.\nA person commits the offense of criminal trespass when he or she intentionally damages any property of another without consent of that other person and the damage thereto is $500.00 or less or knowingly and maliciously interferes with the possession or use of the property of another person without consent of that person.\nA person commits the offense of criminal trespass when he or she knowingly and without authority:\nEnters upon the land or premises of another person or into any part of any vehicle, railroad car, aircraft, or watercraft of another person for an unlawful purpose;\nEnters upon the land or premises of another person or into any part of any vehicle, railroad car, aircraft, or watercraft of another person after receiving, prior to such entry, notice from the owner, rightful occupant, or, upon proper identification, an authorized representative of the owner or rightful occupant that such entry is forbidden; or\nRemains upon the land or premises of another person or within the vehicle, railroad car, aircraft, or watercraft of another person after receiving notice from the owner, rightful occupant, or, upon proper identification, an authorized representative of the owner or rightful occupant to depart.\nFor the purposes of subsection (b) of this Code section, permission to enter or invitation to enter given by a minor who is or is not present on or in the property of the minor's parent or guardian is not sufficient to allow lawful entry of another person upon the land, premises, vehicle, railroad car, aircraft, or watercraft owned or rightfully occupied by such minor's parent or guardian if such parent or guardian has previously given notice that such entry is forbidden or notice to depart.\nA person who commits the offense of criminal trespass shall be guilty of a misdemeanor.\nA person commits the offense of criminal trespass when he or she intentionally defaces, mutilates, or defiles any grave marker, monument, or memorial to one or more deceased persons who served in the military service of this state, the United States of America or any of the states thereof, or the Confederate States of America or any of the states thereof, or a monument, plaque, marker, or memorial which is dedicated to, honors, or recounts the military service of any past or present military personnel of this state, the United States of America or any of the states thereof, or the Confederate States of America or any of the states thereof if such grave marker, monument, memorial, plaque, or marker is privately owned or located on land which is privately owned.\n(Ga. L. 1882-83, p. 121, § 1; Penal Code 1895, § 220; Penal Code 1910, § 217; Code 1933, § 26-3002; Ga. L. 1959, p. 173, § 1; Ga. L. 1960, p. 142, § 1; Code 1933, § 26-1503, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1969, p. 857, § 5; Ga. L. 1979, p. 764, § 1; Ga. L. 1985, p. 484, § 1; Ga. L. 1985, p. 1491, § 1; Ga. L. 1997, p. 526, § 1; Ga. L. 2001, p. 1153, § 1.)\nCross references.\n- Justifiable use of force in defense of property,\n§§\n16-3-23\n,\n16-3-24\n.\nRequirement of written permission to hunt on lands belonging to another,\n§\n27-3-1\n.\nProhibition against unauthorized fishing in waters or from lands belonging to another,\n§\n27-4-2\n.\nTrespassing upon armory, military camp, or other military property,\n§\n38-2-306\n.",
    "text_length": 3338,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-7-23": {
    "section": "16-7-23",
    "heading": "Criminal damage to property in the second degree",
    "text": "16-7-23. Criminal damage to property in the second degree.\nA person commits the offense of criminal damage to property in the second degree when he:\nIntentionally damages any property of another person without his consent and the damage thereto exceeds $500.00; or\nRecklessly or intentionally, by means of fire or explosive, damages property of another person.\nA person convicted of the offense of criminal damage to property in the second degree shall be punished by imprisonment for not less than one nor more than five years.\n(Code 1933, § 26-1502, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1985, p. 484, § 2; Ga. L. 1985, p. 1491, § 2; Ga. L. 2008, p. 444, § 2/SB 400.)",
    "text_length": 676,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-8-2": {
    "section": "16-8-2",
    "heading": "Theft by taking",
    "text": "16-8-2. Theft by taking.\nA person commits the offense of theft by taking when he unlawfully takes or, being in lawful possession thereof, unlawfully appropriates any property of another with the intention of depriving him of the property, regardless of the manner in which the property is taken or appropriated.\n(Laws 1833, Cobb's 1851 Digest, p. 791; Code 1863, § 4290; Code 1868, § 4327; Code 1873, § 4393; Code 1882, § 4393; Penal Code 1895, § 155; Penal Code 1910, § 152; Code 1933, § 26-2602; Code 1933, § 26-1802, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1974, p. 468, § 1; Ga. L. 1975, p. 876, § 1; Ga. L. 1978, p. 2257, § 1.)",
    "text_length": 637,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-8-14": {
    "section": "16-8-14",
    "heading": "Theft by shoplifting",
    "text": "16-8-14. Theft by shoplifting.\nA person commits the offense of theft by shoplifting when such person alone or in concert with another person, with the intent of appropriating merchandise to his or her own use without paying for the same or to deprive the owner of possession thereof or of the value thereof, in whole or in part, does any of the following:\nConceals or takes possession of the goods or merchandise of any store or retail establishment;\nAlters the price tag or other price marking on goods or merchandise of any store or retail establishment;\nTransfers the goods or merchandise of any store or retail establishment from one container to another;\nInterchanges the label or price tag from one item of merchandise with a label or price tag for another item of merchandise; or\nWrongfully causes the amount paid to be less than the merchant's stated price for the merchandise.\nA person convicted of the offense of theft by shoplifting, as provided in subsection (a) of this Code section, when the property which was the subject of the theft is $500.00 or less in value shall be punished as for a misdemeanor; provided, however, that:\nUpon conviction of a second offense for shoplifting, where the first offense is either a felony or a misdemeanor, as defined by this Code section, in addition to or in lieu of any imprisonment which might be imposed, the defendant shall be fined not less than $500.00, and the fine shall not be suspended or probated;\nUpon conviction of a third offense for shoplifting, when the first two offenses are either felonies or misdemeanors, or a combination of a felony and a misdemeanor, as defined by this Code section, in addition to or in lieu of any fine which might be imposed, the defendant shall be punished by imprisonment for not less than 30 days or confinement in a \"special alternative incarceration-probation boot camp,\" probation detention center, or other community correctional facility of the Department of Corrections for a period of 120 days or shall be sentenced to monitored house arrest for a period of 120 days and, in addition to such types of confinement, may be required to undergo psychological evaluation and treatment to be paid for by the defendant; and such sentence of imprisonment or confinement shall not be suspended, probated, deferred, or withheld; and\nUpon conviction of a fourth or subsequent offense for shoplifting, where the prior convictions are either felonies or misdemeanors, or any combination of felonies and misdemeanors, as defined by this Code section, the defendant commits a felony and shall be punished by imprisonment for not less than one nor more than ten years; and the first year of such sentence shall not be suspended, probated, deferred, or withheld.\nA person convicted of the offense of theft by shoplifting, as provided in subsection (a) of this Code section, when the property which was the subject of the theft exceeds $500.00 in value commits a felony and shall be punished by imprisonment for not less than one nor more than ten years.\nA person convicted of the offense of theft by shoplifting, as provided in subsection (a) of this Code section, when the property which was the subject of the theft is taken from three separate stores or retail establishments within one county during a period of seven days or less and when the aggregate value of the property which was the subject of each theft exceeds $500.00 in value, commits a felony and shall be punished by imprisonment for not less than one nor more than ten years.\nA person convicted of the offense of theft by shoplifting, as provided in subsection (a) of this Code section, when the property which was the subject of the theft is taken during a period of 180 days and when the aggregate value of the property which was the subject of each theft exceeds $500.00 in value, commits a felony and shall be punished by imprisonment for not less than one nor more than ten years.\nIn all cases involving theft by shoplifting, the term \"value\" means the actual retail price of the property at the time and place of the offense. The unaltered price tag or other marking on property, or duly identified photographs thereof, shall be prima-facie evidence of value and ownership of the property.\nSubsection (b) of this Code section shall in no way affect the authority of a sentencing judge to provide for a sentence to be served on weekends or during the nonworking hours of the defendant as provided in Code Section 17-10-3, relative to punishment for misdemeanors.\n(Ga. L. 1957, p. 115, §§ 1, 3; Code 1933, § 26-1802.1, enacted by Ga. L. 1978, p. 2257, § 2; Ga. L. 1983, p. 457, § 1; Ga. L. 1997, p. 1394, § 1; Ga. L. 1998, p. 578, § 1; Ga. L. 2000, p. 870, § 1; Ga. L. 2012, p. 899, § 3-3/HB 1176; Ga. L. 2016, p. 443, § 13-1/SB 367; Ga. L. 2017, p. 774, § 16/HB 323.)\nThe 2016 amendment,\neffective July 1, 2016, in subparagraph (b)(1)(B), substituted \"when the first\" for \"where the first\" near the beginning, deleted \", diversion center,\" following \"detention center\" in the middle, and deleted \"either\" following \"in addition to\" near the end.\nThe 2017 amendment,\neffective May 9, 2017, part of an Act to revise, modernize, and correct the Code, revised punctuation in subparagraph (b)(1)(B).\nCross references.\n- Unlawful use of emergency exit door,\n§\n16-11-40\n.\nRecovery for detention or arrest of person suspected of shoplifting,\n§\n51-7-60\n.\nAntishoplifting device,\n§\n51-7-61\n.",
    "text_length": 5442,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-8-18": {
    "section": "16-8-18",
    "heading": "Entering automobile or other motor vehicle with intent to commit theft or felony",
    "text": "16-8-18. Entering automobile or other motor vehicle with intent to commit theft or felony.\nIf any person shall enter any automobile or other motor vehicle with the intent to commit a theft or a felony, he shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one nor more than five years, or, in the discretion of the trial judge, as for a misdemeanor.\n(Ga. L. 1933, p. 111, § 1; Code 1933, § 26-2637; Code 1933, § 26-1813.1, enacted by Ga. L. 1976, p. 186, § 1.)",
    "text_length": 519,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-8-40": {
    "section": "16-8-40",
    "heading": "Robbery",
    "text": "16-8-40. Robbery.\nA person commits the offense of robbery when, with intent to commit theft, he takes property of another from the person or the immediate presence of another:\nBy use of force;\nBy intimidation, by the use of threat or coercion, or by placing such person in fear of immediate serious bodily injury to himself or to another; or\nBy sudden snatching.\nA person convicted of the offense of robbery shall be punished by imprisonment for not less than one nor more than 20 years.\nNotwithstanding any other provision of this Code section, any person who commits the offense of robbery against a person who is 65 years of age or older shall, upon conviction thereof, be punished by imprisonment for not less than five nor more than 20 years.\n(Laws 1833, Cobb's 1851 Digest, p. 791; Code 1863, § 4286; Code 1868, § 4323; Code 1873, § 4389; Code 1882, § 4389; Penal Code 1895, § 151; Ga. L. 1903, p. 43, § 1; Penal Code 1910, § 148; Code 1933, § 26-2501; Ga. L. 1957, p. 261, § 1; Code 1933, § 26-1901, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1984, p. 900, § 4.)",
    "text_length": 1071,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-8-41": {
    "section": "16-8-41",
    "heading": "Armed robbery; robbery by intimidation; taking controlled substance from pharmacy in course of committing offense",
    "text": "16-8-41. Armed robbery; robbery by intimidation; taking controlled substance from pharmacy in course of committing offense.\nA person commits the offense of armed robbery when, with intent to commit theft, he or she takes property of another from the person or the immediate presence of another by use of an offensive weapon, or any replica, article, or device having the appearance of such weapon. The offense of robbery by intimidation shall be a lesser included offense in the offense of armed robbery.\nA person convicted of the offense of armed robbery shall be punished by death or imprisonment for life or by imprisonment for not less than ten nor more than 20 years.\nThe preceding provisions of this Code section notwithstanding, in any case in which the defendant commits armed robbery and in the course of the commission of the offense such person unlawfully takes a controlled substance from a pharmacy or a wholesale druggist and intentionally inflicts bodily injury upon any person, such facts shall be charged in the indictment or accusation and, if found to be true by the court or if admitted by the defendant, the defendant shall be punished by imprisonment for not less than 15 years.\nAs used in this subsection, the term:\n\"Controlled substance\" means a drug, substance, or immediate precursor in Schedules I through V of Code Sections 16-13-25 through 16-13-29.\n\"Pharmacy\" means any place licensed in accordance with Chapter 4 of Title 26 wherein the possessing, displaying, compounding, dispensing, or retailing of drugs may be conducted, including any and all portions of any building or structure leased, used, or controlled by the licensee in the conduct of the business licensed by the State Board of Pharmacy at the address for which the license was issued. The term pharmacy shall also include any building, warehouse, physician's office, or hospital used in whole or in part for the sale, storage, or dispensing of any controlled substance.\n\"Wholesale druggist\" means an individual, partnership, corporation, or association registered with the State Board of Pharmacy under Chapter 4 of Title 26.\nAny person convicted under this Code section shall, in addition, be subject to the sentencing and punishment provisions of Code Sections 17-10-6.1 and 17-10-7.\n(Laws 1833, Cobb's 1851 Digest, p. 791; Ga. L. 1858, p. 98, § 1; Code 1863, §§ 4287, 4288; Code 1868, §§ 4324, 4325; Code 1873, §§ 4390, 4391; Code 1882, §§ 4390, 4391; Ga. L. 1890-91, p. 83, § 1; Penal Code 1895, §§ 152, 153; Penal Code 1910, §§ 149, 150; Code 1933, §§ 26-2502, 26-2503; Ga. L. 1937, p. 490, § 1; Ga. L. 1957, p. 261, §§ 2, 3; Code 1933, § 26-1902, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1969, p. 810, § 1; Ga. L. 1976, p. 1359, § 1; Ga. L. 1981, p. 1266, § 1; Ga. L. 1985, p. 1036, § 1; Ga. L. 1994, p. 1959, § 3; Ga. L. 1999, p. 81, § 16.)\nCross references.\n- Jurisdiction of the Court of Appeals over certain crimes,\n§\n15-3-3\n.\nTime limitation on prosecutions for crimes punishable by death or life imprisonment,\n§\n17-3-1\n.",
    "text_length": 3032,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-9-1": {
    "section": "16-9-1",
    "heading": "Forgery; classification of forgery offenses",
    "text": "16-9-1. Forgery; classification of forgery offenses.\nAs used in this Code section, the term:\n\"Bank\" means incorporated banks, savings banks, banking companies, trust companies, credit unions, and other corporations doing a banking business.\n\"Check\" means any instrument for the payment or transmission of money payable on demand and drawn on a bank.\n\"Writing\" includes, but shall not be limited to, printing or any other method of recording information, money, coins, tokens, stamps, seals, credit cards, badges, trademarks, and other symbols of value, right, privilege, or identification.\nA person commits the offense of forgery in the first degree when with the intent to defraud he or she knowingly makes, alters, or possesses any writing, other than a check, in a fictitious name or in such manner that the writing as made or altered purports to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority and utters or delivers such writing.\nA person commits the offense of forgery in the second degree when with the intent to defraud he or she knowingly makes, alters, or possesses any writing, other than a check, in a fictitious name or in such manner that the writing as made or altered purports to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority.\nA person commits the offense of forgery in the third degree when with the intent to defraud he or she knowingly:\nMakes, alters, possesses, utters, or delivers any check written in the amount of $1,500.00 or more in a fictitious name or in such manner that the check as made or altered purports to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority; or\nPossesses ten or more checks written without a specified amount in a fictitious name or in such manner that the checks as made or altered purport to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority.\nA person commits the offense of forgery in the fourth degree when with the intent to defraud he or she knowingly:\nMakes, alters, possesses, utters, or delivers any check written in the amount of less than $1,500.00 in a fictitious name or in such manner that the check as made or altered purports to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority; or\nPossesses less than ten checks written without a specified amount in a fictitious name or in such manner that the checks as made or altered purport to have been made by another person, at another time, with different provisions, or by authority of one who did not give such authority.\n(Code 1933, § 26-1701, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1969, p. 857, § 6; Ga. L. 2012, p. 899, § 3-5/HB 1176.)\nCross references.\n- Requirements regarding affixing of signatures to negotiable instruments,\n§\n11-3-401\net seq.",
    "text_length": 3089,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-9-121": {
    "section": "16-9-121",
    "heading": "Elements of offense",
    "text": "16-9-121. Elements of offense.\nA person commits the offense of identity fraud when he or she willfully and fraudulently:\nWithout authorization or consent, uses or possesses with intent to fraudulently use identifying information concerning a person;\nUses identifying information of an individual under 18 years old over whom he or she exercises custodial authority;\nUses or possesses with intent to fraudulently use identifying information concerning a deceased individual;\nCreates, uses, or possesses with intent to fraudulently use any counterfeit or fictitious identifying information concerning a fictitious person with intent to use such counterfeit or fictitious identification information for the purpose of committing or facilitating the commission of a crime or fraud on another person; or\nWithout authorization or consent, creates, uses, or possesses with intent to fraudulently use any counterfeit or fictitious identifying information concerning a real person with intent to use such counterfeit or fictitious identification information for the purpose of committing or facilitating the commission of a crime or fraud on another person.\nA person commits the offense of identity fraud by receipt of fraudulent identification information when he or she willingly accepts for identification purposes identifying information which he or she knows to be fraudulent, stolen, counterfeit, or fictitious. In any prosecution under this subsection it shall not be necessary to show a conviction of the principal thief, counterfeiter, or fraudulent user.\nThe offenses created by this Code section shall not merge with any other offense.\nThis Code section shall not apply to a person under the age of 21 who uses a fraudulent, counterfeit, or other false identification card for the purpose of obtaining entry into a business establishment or for purchasing items which he or she is not of legal age to purchase.\n(Code 1981, §\n16-9-121\n, enacted by Ga. L. 1998, p. 865, § 2; Ga. L. 1999, p. 81, § 16; Ga. L. 2002, p. 551, § 2; Ga. L. 2007, p. 450, § 4/SB 236; Ga. L. 2010, p. 568, § 1/HB 1016.)",
    "text_length": 2094,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-10-24": {
    "section": "16-10-24",
    "heading": "Obstructing or hindering law enforcement officers; penalty",
    "text": "16-10-24. Obstructing or hindering law enforcement officers; penalty.\nExcept as otherwise provided in subsection (b) of this Code section, a person who knowingly and willfully obstructs or hinders any law enforcement officer, prison guard, jailer, correctional officer, community supervision officer, county or Department of Juvenile Justice juvenile probation officer, probation officer serving pursuant to Article 6 of Chapter 8 of Title 42, or game warden in the lawful discharge of his or her official duties shall be guilty of a misdemeanor.\nWhoever knowingly and willfully resists, obstructs, or opposes any law enforcement officer, prison guard, jailer, correctional officer, community supervision officer, county or Department of Juvenile Justice juvenile probation officer, probation officer serving pursuant to Article 6 of Chapter 8 of Title 42, or game warden in the lawful discharge of his or her official duties by offering or doing violence to the person of such officer or legally authorized person shall be guilty of a felony and shall, upon a first conviction thereof, be punished by imprisonment for not less than one year nor more than five years. Upon a second conviction for a violation of this subsection, such person shall be punished by imprisonment for not less than two years nor more than ten years. Upon a third or subsequent conviction for a violation of this subsection, such person shall be punished by imprisonment for not less than three years nor more than 15 years.\nWhoever knowingly and willfully resists, obstructs, or opposes any law enforcement officer, prison guard, jailer, correctional officer, community supervision officer, county or Department of Juvenile Justice juvenile probation officer, probation officer serving pursuant to Article 6 of Chapter 8 of Title 42, or game warden in the lawful discharge of his or her official duties by knowingly and willfully throwing, projecting, or expelling human or animal blood, urine, feces, vomitus, or seminal fluid on or at such individual shall be guilty of a felony and shall, upon conviction thereof, be punished by imprisonment for not less than one year nor more than five years.\nA person convicted under this Code section shall be punished, in addition to any term of imprisonment imposed, by a fine as provided by law which shall be at least $300.00. With respect to $300.00 of the fine imposed, after distributing the surcharges and deductions required by Chapter 21 of Title 15, Code Sections 36-15-9 and 42-8-34, and Title 47, it shall be earmarked for the Georgia State Indemnification Fund for purposes of payment of indemnification for death or disability as provided for in Part 1 of Article 5 of Chapter 9 of Title 45.\n(Laws 1833, Cobb's 1851 Digest, p. 806; Code 1863, § 4370; Ga. L. 1865-66, p. 233, § 2; Code 1868, § 4408; Code 1873, § 4476; Code 1882, § 4476; Penal Code 1895, § 306; Penal Code 1910, § 311; Code 1933, § 26-4401; Code 1933, § 26-2505, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1986, p. 484, § 1; Ga. L. 2015, p. 422, § 5-22/HB 310; Ga. L. 2017, p. 500, § 3-4/SB 160; Ga. L. 2019, p. 808, § 7/SB 72.)\nThe 2017 amendment,\neffective July 1, 2017, substituted the present provisions of subsection (a) for the former provisions, which read: \"Except as otherwise provided in subsection (b) of this Code section, a person who knowingly and willfully obstructs or hinders any law enforcement officer in the lawful discharge of his official duties is guilty of a misdemeanor.\"; in subsection (b), in the first sentence, inserted \"jailer,\" near the beginning, substituted \"person shall be guilty\" for \"person is guilty\" in the middle, inserted \"a first\" and inserted \"year\" near the end, and added the second and third sentences; and added subsections (c) and (d).\nThe 2019 amendment,\neffective July 1, 2019, substituted \"game warden\" for \"conservation ranger\" in subsections (a), (b), and (c).\nCross references.\n- Interference with arrest by conservation officer,\n§\n27-1-25\n.\nState-wide alert system established,\n§\n35-3-191\n.",
    "text_length": 4046,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-10-25": {
    "section": "16-10-25",
    "heading": "Giving false name, address, or birthdate to law enforcement officer",
    "text": "16-10-25. Giving false name, address, or birthdate to law enforcement officer.\nA person who gives a false name, address, or date of birth to a law enforcement officer in the lawful discharge of his official duties with the intent of misleading the officer as to his identity or birthdate is guilty of a misdemeanor.\n(Code 1933, § 26-2506, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1989, p. 224, § 1.)",
    "text_length": 403,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-11-36": {
    "section": "16-11-36",
    "heading": "Loitering or prowling",
    "text": "16-11-36. Loitering or prowling.\nA person commits the offense of loitering or prowling when he is in a place at a time or in a manner not usual for law-abiding individuals under circumstances that warrant a justifiable and reasonable alarm or immediate concern for the safety of persons or property in the vicinity.\nAmong the circumstances which may be considered in determining whether alarm is warranted is the fact that the person takes flight upon the appearance of a law enforcement officer, refuses to identify himself, or manifestly endeavors to conceal himself or any object. Unless flight by the person or other circumstances make it impracticable, a law enforcement officer shall, prior to any arrest for an offense under this Code section, afford the person an opportunity to dispel any alarm or immediate concern which would otherwise be warranted by requesting the person to identify himself and explain his presence and conduct. No person shall be convicted of an offense under this Code section if the law enforcement officer failed to comply with the foregoing procedure or if it appears at trial that the explanation given by the person was true and would have dispelled the alarm or immediate concern.\nA person committing the offense of loitering or prowling shall be guilty of a misdemeanor.\nThis Code section shall not be deemed or construed to affect or limit the powers of counties or municipal corporations to adopt ordinances or resolutions prohibiting loitering or prowling within their respective limits.\n(Code 1933, § 26-2616, enacted by Ga. L. 1980, p. 388, § 1.)\nCross references.\n- Loitering on school property,\n§\n20-2-1180\n.\nRestriction on registered offenders residing, working, or loitering within certain distance of child care facilities, churches, schools, or areas where minors congregate; penalty for violations; civil causes of action,\n§\n42-1-15\n.",
    "text_length": 1886,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-11-39": {
    "section": "16-11-39",
    "heading": "Disorderly conduct",
    "text": "16-11-39. Disorderly conduct.\nA person commits the offense of disorderly conduct when such person commits any of the following:\nActs in a violent or tumultuous manner toward another person whereby such person is placed in reasonable fear of the safety of such person's life, limb, or health;\nActs in a violent or tumultuous manner toward another person whereby the property of such person is placed in danger of being damaged or destroyed;\nWithout provocation, uses to or of another person in such other person's presence, opprobrious or abusive words which by their very utterance tend to incite to an immediate breach of the peace, that is to say, words which as a matter of common knowledge and under ordinary circumstances will, when used to or of another person in such other person's presence, naturally tend to provoke violent resentment, that is, words commonly called \"fighting words\"; or\nWithout provocation, uses obscene and vulgar or profane language in the presence of or by telephone to a person under the age of 14 years which threatens an immediate breach of the peace.\nAny person who commits the offense of disorderly conduct shall be guilty of a misdemeanor.\nThis Code section shall not be deemed or construed to affect or limit the powers of counties or municipal corporations to adopt ordinances or resolutions prohibiting disorderly conduct within their respective limits.\n(Code 1863, § 4271; Ga. L. 1865-66, p. 233, § 2; Code 1868, § 4306; Ga. L. 1872, p. 9, § 1; Code 1873, § 4372; Ga. L. 1875, p. 25, § 1; Code 1882, § 4372; Ga. L. 1890-91, p. 83, § 1; Penal Code 1895, § 396; Penal Code 1910, § 387; Ga. L. 1919, p. 103, § 1; Code 1933, § 26-6303; Ga. L. 1963, p. 455, § 1; Code 1933, § 26-2610, enacted by Ga. L. 1968, p. 1249, § 1; Ga. L. 1974, p. 470, § 1; Ga. L. 1992, p. 6, § 16; Ga. L. 1995, p. 574, § 3.)\nCross references.\n- Constitutional guarantee of free speech and press, Ga. Const. 1983, Art. I, Sec. I, Para. V.\nFurther provisions regarding unlawful communications by telephone,\n§\n46-5-21\n.\nUse of telephone to transmit obscene or lewd communications for commercial purposes,\n§\n46-5-22\n.",
    "text_length": 2125,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-11-39.1": {
    "section": "16-11-39.1",
    "heading": "Harassing communications; venue; separate offenses; impact on free speech",
    "text": "16-11-39.1. Harassing communications; venue; separate offenses; impact on free speech.\nA person commits the offense of harassing communications if such person:\nContacts another person repeatedly via telecommunication, e-mail, text messaging, or any other form of electronic communication for the purpose of harassing, molesting, threatening, or intimidating such person or the family of such person;\nThreatens bodily harm via telecommunication, e-mail, text messaging, or any other form of electronic communication;\nTelephones another person and intentionally fails to hang up or disengage the connection; or\nKnowingly permits any device used for telecommunication, e-mail, text messaging, or any other form of electronic communication under such person's control to be used for any purpose prohibited by this subsection.\nAny person who commits the offense of harassing communications shall be guilty of a misdemeanor.\nThe offense of harassing communications shall be considered to have been committed in the county where:\nThe defendant was located when he or she placed the telephone call or transmitted, sent, or posted an electronic communication; or\nThe telephone call or electronic communication was received.\nAny violation of this Code section shall constitute a separate offense and shall not merge with any other crimes set forth in this title.\nThis Code section shall not apply to constitutionally protected speech.\n(Code 1981, §\n16-11-39.1\n, enacted by Ga. L. 1995, p. 574, § 3; Ga. L. 2015, p. 203, § 2-1/SB 72.)\nCross references.\n- Free speech, U.S. Const., amend I.",
    "text_length": 1578,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-11-41": {
    "section": "16-11-41",
    "heading": "Public drunkenness",
    "text": "16-11-41. Public drunkenness.\nA person who shall be and appear in an intoxicated condition in any public place or within the curtilage of any private residence not his own other than by invitation of the owner or lawful occupant, which condition is made manifest by boisterousness, by indecent condition or act, or by vulgar, profane, loud, or unbecoming language, is guilty of a misdemeanor.\nThis Code section shall not be construed to affect the powers delegated to counties or to municipal corporations to pass laws to punish drunkenness or disorderly conduct within their respective limits.\n(Code 1933, § 26-2607, enacted by Ga. L. 1968, p. 1249, § 1.)\nCross references.\n- Intoxication as relieving person from criminal responsibility for actions,\n§\n16-3-4\n.\nDriving under influence of alcohol,\n§\n40-6-391\n.",
    "text_length": 811,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-11-131": {
    "section": "16-11-131",
    "heading": "Possession of firearms by convicted felons and first offender probationers",
    "text": "16-11-131. Possession of firearms by convicted felons and first offender probationers.\nAs used in this Code section, the term:\n\"Felony\" means any offense punishable by imprisonment for a term of one year or more and includes conviction by a court-martial under the Uniform Code of Military Justice for an offense which would constitute a felony under the laws of the United States.\n\"Firearm\" includes any handgun, rifle, shotgun, or other weapon which will or can be converted to expel a projectile by the action of an explosive or electrical charge.\nAny person who is on probation as a felony first offender pursuant to Article 3 of Chapter 8 of Title 42, who is on probation and was sentenced for a felony under subsection (a) or (c) of Code Section 16-13-2, or who has been convicted of a felony by a court of this state or any other state; by a court of the United States including its territories, possessions, and dominions; or by a court of any foreign nation and who receives, possesses, or transports any firearm commits a felony and, upon conviction thereof, shall be imprisoned for not less than one year nor more than ten years; provided, however, that upon a second or subsequent conviction, such person shall be imprisoned for not less than five nor more than ten years; provided, further, that if the felony for which the person is on probation or has been previously convicted is a forcible felony, then upon conviction of receiving, possessing, or transporting a firearm, such person shall be imprisoned for a period of five years.\n(b.1)\nAny person who is prohibited by this Code section from possessing a firearm because of conviction of a forcible felony or because of being on probation as a first offender or under conditional discharge for a forcible felony and who attempts to purchase or obtain transfer of a firearm shall be guilty of a felony and upon conviction shall be punished by imprisonment for not less than one year nor more than five years; provided, however, that upon a second or subsequent conviction, such person shall be punished by imprisonment for not less than five nor more than ten years.\nThis Code section shall not apply to any person who has been pardoned for the felony by the President of the United States, the State Board of Pardons and Paroles, or the person or agency empowered to grant pardons under the constitutions or laws of the several states or of a foreign nation and, by the terms of the pardon, has expressly been authorized to receive, possess, or transport a firearm.\nA person who has been convicted of a felony, but who has been granted relief from the disabilities imposed by the laws of the United States with respect to the acquisition, receipt, transfer, shipment, or possession of firearms by the secretary of the United States Department of the Treasury pursuant to 18 U.S.C. Section 925, shall, upon presenting to the Board of Public Safety proof that the relief has been granted and it being established from proof submitted by the applicant to the satisfaction of the Board of Public Safety that the circumstances regarding the conviction and the applicant's record and reputation are such that the acquisition, receipt, transfer, shipment, or possession of firearms by the person would not present a threat to the safety of the citizens of Georgia and that the granting of the relief sought would not be contrary to the public interest, be granted relief from the disabilities imposed by this Code section. A person who has been convicted under federal or state law of a felony pertaining to antitrust violations, unfair trade practices, or restraint of trade shall, upon presenting to the Board of Public Safety proof, and it being established from said proof, submitted by the applicant to the satisfaction of the Board of Public Safety that the circumstances regarding the conviction and the applicant's record and reputation are such that the acquisition, receipt, transfer, shipment, or possession of firearms by the person would not present a threat to the safety of the citizens of Georgia and that the granting of the relief sought would not be contrary to the public interest, be granted relief from the disabilities imposed by this Code section. A record that the relief has been granted by the board shall be entered upon the criminal history of the person maintained by the Georgia Crime Information Center and the board shall maintain a list of the names of such persons which shall be open for public inspection.\nAs used in this Code section, the term \"forcible felony\" means any felony which involves the use or threat of physical force or violence against any person and further includes, without limitation, murder; murder in the second degree; burglary in any degree; robbery; armed robbery; home invasion in any degree; kidnapping; hijacking of an aircraft or hijacking a motor vehicle in the first degree; aggravated stalking; rape; aggravated child molestation; aggravated sexual battery; arson in the first degree; the manufacturing, transporting, distribution, or possession of explosives with intent to kill, injure, or intimidate individuals or destroy a public building; terroristic threats; or acts of treason or insurrection.\nAny person sentenced as a first offender pursuant to Article 3 of Chapter 8 of Title 42 or sentenced pursuant to subsection (a) or (c) of Code Section 16-13-2 and subsequently discharged without court adjudication of guilt as a matter of law pursuant to Code Section 42-8-60 or 16-13-2, as applicable, shall, upon such discharge, be relieved from the disabilities imposed by this Code section.\n(Code 1933, § 26-2914, enacted by Ga. L. 1980, p. 1509, § 1; Ga. L. 1982, p. 1171, § 2; Ga. L. 1983, p. 945, § 1; Ga. L. 1987, p. 476, §§ 1, 2; Ga. L. 1989, p. 14, § 16; Ga. L. 2000, p. 1630, § 5; Ga. L. 2012, p. 899, § 8-5/HB 1176; Ga. L. 2014, p. 426, § 4/HB 770; Ga. L. 2014, p. 444, § 2-5/HB 271; Ga. L. 2016, p. 443, § 6C-2/SB 367; Ga. L. 2017, p. 417, § 3-1/SB 104; Ga. L. 2018, p. 550, § 4-4/SB 407.)\nThe 2016 amendment,\neffective July 1, 2016, substituted \"as a matter of law pursuant to Code Section 42-8-60\" for \"pursuant to Code Section 42-8-62\" near the middle of subsection (f).\nThe 2017 amendment,\neffective July 1, 2017, in the middle of subsection (e), inserted \"hijacking a\" and inserted \"in the first degree\".\nThe 2018 amendment,\neffective July 1, 2018, in subsection (b), inserted \", who is on probation and was sentenced for a felony under subsection (a) or (c) of Code Section 16-13-2,\" near the middle, inserted \"year\", and substituted \"ten years\" for \"five years\" in the middle, in the proviso, inserted \"upon a second or subsequent conviction, such person shall be imprisoned for not less than five nor more than ten years; provided, further, that\", and substituted \"for\" for \"as to\" in the middle of the proviso; in paragraph (b.1), inserted \"or under conditional discharge\", deleted \"pursuant to this Code section\" following \"forcible felony\" near the middle, inserted \"upon conviction\", inserted \"year\" in the middle, and added the proviso; and, in subsection (f), substituted \"sentenced\" for \"placed on probation\" near the beginning, and, in the middle, inserted \"or sentenced pursuant to subsection (a) or (c) of Code Section 16-13-2\" and inserted \"or 16-13-2, as applicable,\".\nCross references.\n- Unauthorized possession of weapon by person confined in penal institution,\n§\n42-5-63\n.\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1988, \"of\" was deleted following \"Chapter \" in subsection (e) (now (f)).\nPursuant to Code Section 28-9-5, in 1996, \"18 U.S.C. Section 925\" was substituted for \"18 U.S.C. 925\" in the first sentence of subsection (d).",
    "text_length": 7715,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-13-30": {
    "section": "16-13-30",
    "heading": "Purchase, possession, manufacture, distribution, or sale of controlled substances or marijuana; penalties",
    "text": "16-13-30. Purchase, possession, manufacture, distribution, or sale of controlled substances or marijuana; penalties.\nExcept as authorized by this article, it is unlawful for any person to purchase, possess, or have under his or her control any controlled substance.\nExcept as authorized by this article, it is unlawful for any person to manufacture, deliver, distribute, dispense, administer, sell, or possess with intent to distribute any controlled substance.\nExcept as otherwise provided, any person who violates subsection (a) of this Code section with respect to a controlled substance in Schedule I or a narcotic drug in Schedule II shall be guilty of a felony and, upon conviction thereof, shall be punished as follows:\nIf the aggregate weight, including any mixture, is less than one gram of a solid substance, less than one milliliter of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of less than one gram, by imprisonment for not less than one nor more than three years;\nIf the aggregate weight, including any mixture, is at least one gram but less than four grams of a solid substance, at least one milliliter but less than four milliliters of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of at least one gram but less than four grams, by imprisonment for not less than one nor more than eight years; and\nExcept as provided in subparagraph (B) of this paragraph, if the aggregate weight, including any mixture, is at least four grams but less than 28 grams of a solid substance, at least four milliliters but less than 28 milliliters of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of at least four grams but less than 28 grams, by imprisonment for not less than one nor more than 15 years.\nThis paragraph shall not apply to morphine, heroin, opium, or any substance identified in subparagraph (RR) or (SS) of paragraph (1) or paragraph (13), (14), or (15) of Code Section 16-13-25, or subparagraph (A), (C.5), (F), (U.1), (V), or (V.2) of paragraph (2) of Code Section 16-13-26 or any salt, isomer, or salt of an isomer; rather, the provisions of Code Section 16-13-31 shall control these substances.\nExcept as otherwise provided, any person who violates subsection (b) of this Code section with respect to a controlled substance in Schedule I or Schedule II shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than five years nor more than 30 years. Upon conviction of a second or subsequent offense, he or she shall be imprisoned for not less than ten years nor more than 40 years or life imprisonment. The provisions of subsection (a) of Code Section 17-10-7 shall not apply to a sentence imposed for a second such offense; provided, however, that the remaining provisions of Code Section 17-10-7 shall apply for any subsequent offense.\nAny person who violates subsection (a) of this Code section with respect to a controlled substance in Schedule II, other than a narcotic drug, shall be guilty of a felony and, upon conviction thereof, shall be punished as follows:\nIf the aggregate weight, including any mixture, is less than two grams of a solid substance, less than two milliliters of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of less than two grams, by imprisonment for not less than one nor more than three years;\nIf the aggregate weight, including any mixture, is at least two grams but less than four grams of a solid substance, at least two milliliters but less than four milliliters of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of at least two grams but less than four grams, by imprisonment for not less than one nor more than eight years; and\nIf the aggregate weight, including any mixture, is at least four grams but less than 28 grams of a solid substance, at least four milliliters but less than 28 milliliters of a liquid substance, or if the substance is placed onto a secondary medium with a combined weight of at least four grams but less than 28 grams, by imprisonment for not less than one nor more than 15 years.\nUpon a third or subsequent conviction for a violation of subsection (a) of this Code section with respect to a controlled substance in Schedule I or II or subsection (i) of this Code section, such person shall be punished by imprisonment for a term not to exceed twice the length of the sentence applicable to the particular crime.\nExcept as provided in subsection (l) of this Code section, any person who violates subsection (a) of this Code section with respect to a controlled substance in Schedule III, IV, or V shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than three years. Upon conviction of a third or subsequent offense, he or she shall be imprisoned for not less than one year nor more than five years.\nAny person who violates subsection (b) of this Code section with respect to a controlled substance in Schedule III, IV, or V shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than ten years.\nExcept as authorized by this article, it is unlawful for any person to possess or have under his or her control a counterfeit substance. Any person who violates this paragraph shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than two years.\nExcept as authorized by this article, it is unlawful for any person to manufacture, deliver, distribute, dispense, administer, purchase, sell, or possess with intent to distribute a counterfeit substance. Any person who violates this paragraph shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than ten years.\nIt shall be unlawful for any person to possess, have under his or her control, manufacture, deliver, distribute, dispense, administer, purchase, sell, or possess with intent to distribute marijuana.\nExcept as otherwise provided in subsection (c) of Code Section 16-13-31 or in Code Section 16-13-2, any person who violates this subsection shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than ten years.\nIt shall be unlawful for any person to hire, solicit, engage, or use an individual under the age of 17 years, in any manner, for the purpose of manufacturing, distributing, or dispensing, on behalf of the solicitor, any controlled substance, counterfeit substance, or marijuana unless the manufacturing, distribution, or dispensing is otherwise allowed by law. Any person who violates this subsection shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than five years nor more than 20 years or by a fine not to exceed $20,000.00, or both.\nAny person who violates subsection (a) of this Code section with respect to flunitrazepam, a Schedule IV controlled substance, shall be guilty of a felony and, upon conviction thereof, shall be punished as follows:\nIf the aggregate weight, including any mixture, is less than two grams of a solid substance of flunitrazepam, less than two milliliters of liquid flunitrazepam, or if flunitrazepam is placed onto a secondary medium with a combined weight of less than two grams, by imprisonment for not less than one nor more than three years;\nIf the aggregate weight, including any mixture, is at least two grams but less than four grams of a solid substance of flunitrazepam, at least two milliliters but less than four milliliters of liquid flunitrazepam, or if the flunitrazepam is placed onto a secondary medium with a combined weight of at least two grams but less than four grams, by imprisonment for not less than one nor more than eight years; and\nIf the aggregate weight, including any mixture, is at least four grams of a solid substance of flunitrazepam, at least four milliliters of liquid flunitrazepam, or if the flunitrazepam is placed onto a secondary medium with a combined weight of at least four grams, by imprisonment for not less than one nor more than 15 years.\nAny person who violates subsection (b) of this Code section with respect to flunitrazepam, a Schedule IV controlled substance, shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment for not less than five years nor more than 30 years. Upon conviction of a second or subsequent offense, such person shall be punished by imprisonment for not less than ten years nor more than 40 years or life imprisonment. The provisions of subsection (a) of Code Section 17-10-7 shall not apply to a sentence imposed for a second such offense, but that subsection and the remaining provisions of Code Section 17-10-7 shall apply for any subsequent offense.\nAs used in this Code section, the term \"solid substance\" means a substance that is not in a liquid or gas form. Such term shall include tablets, pills, capsules, caplets, powder, crystal, or any variant of such items.\n(Code 1933, § 79A-811, enacted by Ga. L. 1974, p. 221, § 1; Ga. L. 1975, p. 1112, § 1; Ga. L. 1979, p. 1258, § 1;\nThe 2017 amendment,\neffective May 8, 2017, substituted the present provisions of subparagraph (c)(3)(B) for the former provisions, which read: \"This paragraph shall not apply to morphine, heroin, or opium or any salt, isomer, or salt of an isomer; rather, the provisions of Code Section 16-13-31 shall control these substances.\".\nCross references.\n- Jurisdiction in marijuana possession cases; retention of fines and forfeitures; transfer of cases,\n§\n36-32-6\n.\nUse of marijuana for treatment of cancer and glaucoma,\n§\n43-34-120\net seq.",
    "text_length": 9944,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-13-31": {
    "section": "16-13-31",
    "heading": "Trafficking in cocaine, illegal drugs, marijuana, or methamphetamine; penalties",
    "text": "16-13-31. Trafficking in cocaine, illegal drugs, marijuana, or methamphetamine; penalties.\nExcept as authorized by this article, any person who sells, manufactures, delivers, or brings into this state or who is in possession of 28 grams or more of cocaine or of any mixture with a purity of 10 percent or more of cocaine, as described in Schedule II, in violation of this article commits the felony offense of trafficking in cocaine and, upon conviction thereof, shall be punished as follows:\nIf the quantity of the cocaine or the mixture involved is 28 grams or more, but less than 200 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of ten years and shall pay a fine of $200,000.00;\nIf the quantity of the cocaine or the mixture involved is 200 grams or more, but less than 400 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of 15 years and shall pay a fine of $300,000.00; and\nIf the quantity of the cocaine or the mixture involved is 400 grams or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 25 years and shall pay a fine of $1 million.\nExcept as authorized by this article, any person who sells, manufactures, delivers, or brings into this state or who is in possession of any mixture with a purity of less than 10 percent of cocaine, as described in Schedule II, in violation of this article commits the felony offense of trafficking in cocaine if the total weight of the mixture multiplied by the percentage of cocaine contained in the mixture exceeds any of the quantities of cocaine specified in paragraph (1) of this subsection. Upon conviction thereof, such person shall be punished as provided in paragraph (1) of this subsection, depending upon the quantity of cocaine such person is charged with selling, manufacturing, delivering, or bringing into this state or possessing.\nExcept as authorized by this article, any person who sells, manufactures, delivers, brings into this state, or has possession of four grams or more of any morphine, opium, or substance identified in subparagraph (RR) or (SS) of paragraph (1) or paragraph (13), (14), or (15) of Code Section 16-13-25, or subparagraph (A), (C.5), (F), (U.1), (V), or (V.2) of paragraph (2) of Code Section 16-13-26 or any salt, isomer, or salt of an isomer thereof, including heroin, as described in Schedules I and II, or four grams or more of any mixture containing any such substance in violation of this article commits the felony offense of trafficking in illegal drugs and, upon conviction thereof, shall be punished as follows:\nIf the quantity of such substances involved is four grams or more, but less than 14 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of five years and shall pay a fine of $50,000.00;\nIf the quantity of such substances involved is 14 grams or more, but less than 28 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of ten years and shall pay a fine of $100,000.00; and\nIf the quantity of such substances involved is 28 grams or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 25 years and shall pay a fine of $500,000.00.\nExcept as authorized by this article, any person who sells, manufactures, grows, delivers, brings into this state, or has possession of a quantity of marijuana exceeding ten pounds commits the offense of trafficking in marijuana and, upon conviction thereof, shall be punished as follows:\nIf the quantity of marijuana involved is in excess of ten pounds, but less than 2,000 pounds, the person shall be sentenced to a mandatory minimum term of imprisonment of five years and shall pay a fine of $100,000.00;\nIf the quantity of marijuana involved is 2,000 pounds or more, but less than 10,000 pounds, the person shall be sentenced to a mandatory minimum term of imprisonment of seven years and shall pay a fine of $250,000.00; and\nIf the quantity of marijuana involved is 10,000 pounds or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 15 years and shall pay a fine of $1 million.\nExcept as authorized by this article, any person who sells, manufactures, delivers, or brings into this state 200 grams or more of methaqualone or of any mixture containing methaqualone, as described in paragraph (6) of Code Section 16-13-25, in violation of this article commits the felony offense of trafficking in methaqualone and, upon conviction thereof, shall be punished as follows:\nIf the quantity of the methaqualone or the mixture involved is 200 grams or more, but less than 400 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of five years and shall pay a fine of $50,000.00; and\nIf the quantity of the methaqualone or the mixture involved is 400 grams or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 15 years and shall pay a fine of $250,000.00.\nExcept as authorized by this article, any person who sells, delivers, or brings into this state or has possession of 28 grams or more of methamphetamine, amphetamine, or any mixture containing either methamphetamine or amphetamine, as described in Schedule II, in violation of this article commits the felony offense of trafficking in methamphetamine or amphetamine and, upon conviction thereof, shall be punished as follows:\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is 28 grams or more, but less than 200 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of ten years and shall pay a fine of $200,000.00;\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is 200 grams or more, but less than 400 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of 15 years and shall pay a fine of $300,000.00; and\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is 400 grams or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 25 years and shall pay a fine of $1 million.\nExcept as authorized by this article, any person who manufactures methamphetamine, amphetamine, or any mixture containing either methamphetamine or amphetamine, as described in Schedule II, in violation of this article commits the felony offense of trafficking methamphetamine or amphetamine and, upon conviction thereof, shall be punished as follows:\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is less than 200 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of ten years and shall pay a fine of $200,000.00;\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is 200 grams or more, but less than 400 grams, the person shall be sentenced to a mandatory minimum term of imprisonment of 15 years and shall pay a fine of $300,000.00; and\nIf the quantity of methamphetamine, amphetamine, or a mixture containing either substance involved is 400 grams or more, the person shall be sentenced to a mandatory minimum term of imprisonment of 25 years and shall pay a fine of $1 million.\nThe district attorney may move the sentencing court to impose a reduced or suspended sentence upon any person who is convicted of a violation of this Code section who provides substantial assistance in the identification, arrest, or conviction of any of his or her accomplices, accessories, coconspirators, or principals. Upon good cause shown, the motion may be filed and heard in camera. The judge hearing the motion may impose a reduced or suspended sentence if he or she finds that the defendant has rendered such substantial assistance.\nIn the court's discretion, the judge may depart from the mandatory minimum sentence specified for a person who is convicted of a violation of this Code section as set forth in subparagraph (B) of this paragraph if the judge concludes that:\nThe defendant was not a leader of the criminal conduct;\nThe defendant did not possess or use a firearm, dangerous weapon, or hazardous object during the crime;\nThe criminal conduct did not result in a death or serious bodily injury to a person other than to a person who is a party to the crime;\nThe defendant has no prior felony conviction; and\nThe interests of justice will not be served by the imposition of the prescribed mandatory minimum sentence.\nThe sentencing departure ranges pursuant to subparagraph (A) of this paragraph shall be as follows:\nAny person convicted of violating paragraph (1) of subsection (b) or (d) of this Code section, two years and six months to five years imprisonment and a fine of not less than $25,000.00 nor more than $50,000.00;\nAny person convicted of violating paragraph (1) of subsection (c) of this Code section, two years and six months to five years imprisonment and a fine of not less than $50,000.00 nor more than $100,000.00;\nAny person convicted of violating paragraph (2) of subsection (c) of this Code section, three years and six months to seven years imprisonment and a fine of not less than $125,000.00 nor more than $250,000.00;\nAny person convicted of violating subparagraph (a)(1)(A), paragraph (2) of subsection (a), relating to the quantity of drugs specified in subparagraph (a)(1)(A) of this Code section, or paragraph (1) of subsection (e) or (f) of this Code section, five to ten years imprisonment and a fine of not less than $100,000.00 nor more than $200,000.00;\nAny person convicted of violating paragraph (2) of subsection (b) of this Code section, five to ten years imprisonment and a fine of not less than $50,000.00 nor more than $100,000.00;\nAny person convicted of violating subparagraph (a)(1)(B), paragraph (2) of subsection (a), relating to the quantity of drugs specified in subparagraph (a)(1)(B) of this Code section, or paragraph (2) of subsection (e) or (f) of this Code section, seven years and six months to 15 years imprisonment and a fine of not less than $150,000.00 nor more than $300,000.00;\nAny person convicted of violating paragraph (3) of subsection (c) of this Code section, seven years and six months to 15 years imprisonment and a fine of not less than $500,000.00 nor more than $1 million;\nAny person convicted of violating paragraph (2) of subsection (d) of this Code section, seven years and six months to 15 years imprisonment and a fine of not less than $125,000.00 nor more than $250,000.00;\nAny person convicted of violating paragraph (3) of subsection (b) of this Code section, 12 years and six months to 25 years imprisonment and a fine of not less than $250,000.00 nor more than $500,000.00; and\nAny person convicted of violating subparagraph (a)(1)(C), paragraph (2) of subsection (a), relating to the quantity of drugs specified in subparagraph (a)(1)(C) of this Code section, or paragraph (3) of subsection (e) or (f) of this Code section, 12 years and six months to 25 years imprisonment and a fine of not less than $500,000.00 nor more than $1 million.\nIf a judge reduces the mandatory minimum sentence pursuant to this paragraph, the judge shall specify on the record the circumstances for the reduction and the interests served by such departure. Any such order shall be appealable by the State of Georgia pursuant to Code Section 5-7-1.\nAs used in this paragraph, the term:\n\"Dangerous weapon\" shall have the same meaning as set forth in Code Section 16-11-121.\n\"Firearm\" shall have the same meaning as set forth in Code Section 16-11-127.1.\n\"Hazardous object\" shall have the same meaning as set forth in Code Section 20-2-751.\n\"Leader\" means a person who planned and organized others and acted as a guiding force in order to achieve a common goal.\nIn the court's discretion, the judge may depart from the mandatory minimum sentence specified in this Code section for a person who is convicted of a violation of this Code section when the prosecuting attorney and the defendant have agreed to a sentence that is below such mandatory minimum.\nAny person who violates any provision of this Code section shall be punished as provided for in the applicable mandatory minimum punishment and for not more than 30 years of imprisonment and by a fine not to exceed $1 million.\nNotwithstanding Code Section 16-13-2, any sentence imposed pursuant to subsection (g) of this Code section shall not be reduced by any earned time, early release, work release, leave, or other sentence-reducing measures under programs administered by the Department of Corrections, the effect of which would be to reduce the period of incarceration ordered by the sentencing court or any form of pardon, parole, or commutation of sentence by the State Board of Pardons and Paroles; provided, however, that during the final year of incarceration, a defendant so sentenced shall be eligible to be considered for participation in a Department of Corrections administered transitional center or work release program.\n(Ga. L. 1980, p. 432, § 1; Ga. L. 1982, p. 3, § 16; Ga. L. 1982, p. 2215, § 1; Ga. L. 1983, p. 620, § 1; Ga. L. 1985, p. 149, § 16; Ga. L. 1985, p. 552, § 1; Ga. L. 1986, p. 10, § 16; Ga. L. 1986, p. 397, § 1; Ga. L. 1988, p. 420, § 2; Ga. L. 1989, p. 1594, § 1; Ga. L. 1992, p. 2106, § 1; Ga. L. 1994, p. 169, § 5.1; Ga. L. 1997, p. 1311, § 5; Ga. L. 2003, p. 177, § 4; Ga. L. 2003, p. 257, § 1; Ga. L. 2012, p. 899, § 3-8/HB 1176; Ga. L. 2013, p. 222, § 4/HB 349; Ga. L. 2014, p. 432, § 2-8/HB 826; Ga. L. 2014, p. 780, § 2-2/SB 364; Ga. L. 2015, p. 5, § 16/HB 90; Ga. L. 2017, p. 417, § 6-2/SB 104.)\nThe 2017 amendment,\neffective May 8, 2017, substituted \"Except as authorized by this article, any\" for \"Any\" throughout subsections (a) through (f); and, in subsection (b), in the middle, substituted \"morphine, opium\" for \"morphine or opium\" and inserted \", or substance identified in subparagraph (RR) or (SS) of paragraph (1) or paragraph (13), (14), or (15) of Code Section 16-13-25, or subparagraph (A), (C.5), (F), (U.1), (V), or (V.2) of paragraph (2) of Code Section 16-13-26\".\nCross references.\n- Reward for furnishing information leading to arrest and conviction of person charged with selling controlled substance in violation of section,\n§\n45-12-37\n.\nCode Commission notes.\n- Pursuant to Code Section 28-9-5, in 1987, a comma was deleted following \"Code section\" in subsection (f) (now (h)).",
    "text_length": 14482,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-1": {
    "section": "17-5-1",
    "heading": "Search warrants; issuance; execution; return",
    "text": "17-5-1.\nSearch pursuant to lawful arrest authorized.\nWhen a lawful arrest is effected a peace officer may reasonably search the person arrested and the area within the person’s immediate presence for the purpose of:\nProtecting the officer from attack;\nPreventing the person from escaping;\nDiscovering or seizing the fruits of the crime for which the person has been arrested; or\nDiscovering or seizing any instruments, articles, or things which are being used or which may have been used in the commission of the crime for which the person has been arrested.\nWhen the peace officer is in the process of effecting a lawful search, nothing in this Code section shall be construed to preclude him from discovering or seizing any stolen or embezzled property, any item, substance, object, thing, or matter, the possession of which is unlawful, or any item, substance, object, thing, or matter, other than the private papers of any person, which is tangible evidence of the commission of a crime against the laws of this state.\nHistory.",
    "text_length": 1031,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-2": {
    "section": "17-5-2",
    "heading": "Persons authorized to issue search warrants",
    "text": "17-5-2.\nInventory of items seized without search warrant to be given to person arrested and judicial officer before whom person arrested taken; return of items.\nAn inventory of all instruments, articles, or things seized in a search without a search warrant shall be given to the person arrested and a copy thereof delivered to the judicial officer before whom the person arrested is taken. If the person arrested is released without a charge being preferred against him, all instruments, articles, or things seized, other than contraband or stolen property, shall be returned to him upon release.\nHistory.",
    "text_length": 606,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-20": {
    "section": "17-5-20",
    "heading": "Searches and seizures; definition of consent",
    "text": "17-5-20.\nRequirements for issuance of search warrant generally.\nA search warrant may be issued only upon the application of an officer of this state or its political subdivisions charged with the duty of enforcing the criminal laws or a currently certified peace officer engaged in the course of official duty, whether said officer is employed by a law enforcement unit of:\nThe state or a political subdivision of the state; or\nA university, college, or school.\nA search warrant shall not be issued upon the application of a private citizen or for his aid in the enforcement of personal, civil, or property rights.\nHistory.",
    "text_length": 623,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-21": {
    "section": "17-5-21",
    "heading": "Search and seizure upon probable cause; warrantless searches",
    "text": "17-5-21.\nGrounds for issuance of search warrant; scope of search pursuant to search warrant; issuance by retired judge or judge emeritus.\nUpon the written complaint of any certified peace officer of this state or its political subdivisions charged with the duty of enforcing the criminal laws and otherwise as authorized in Code Section 17-5-20 under oath or affirmation, which states facts sufficient to show probable cause that a crime is being committed or has been committed and which particularly describes the place or person, or both, to be searched and things to be seized, any judicial officer authorized to hold a court of inquiry to examine into an arrest of an offender against the penal laws, referred to in this Code section as “judicial officer,” may issue a search warrant for the seizure of the following:\nAny instruments, articles, or things, including the private papers of any person, which are designed, intended for use, or which have been used in the commission of the offense in connection with which the warrant is issued;\nAny person who has been kidnapped in violation of the laws of this state, who has been kidnapped in another jurisdiction and is now concealed within this state, or any human fetus or human corpse;\nStolen or embezzled property;\nAny item, substance, object, thing, or matter, the possession of which is unlawful; or\nAny instruments, articles or things, any information or data, and anything that is tangible or intangible, corporeal or incorporeal, visible or invisible evidence of the commission of the crime for which probable cause is shown, other than the private papers of any person.\nWhen the peace officer is in the process of effecting a lawful search, nothing in this Code section shall preclude such officer from discovering or seizing any stolen or embezzled property, any item, substance, object, thing, or matter, the possession of which is unlawful, or any item, substance, object, thing, or matter, other than the private papers of any person, which is tangible evidence of the commission of a crime against the laws of this state, the United States, or another state. Other personnel, sworn or unsworn, acting under the direction of a peace officer executing a search warrant may assist in the execution of such warrant. While in the process of effecting a lawful arrest or lawful search, nothing in this Code section nor in Code Section 16-11-62 shall be construed to preclude the use of any device, as such term is defined in Code Section 16-11-60, by the peace officer executing the search warrant or other personnel assisting in the execution of such warrant.\nAny retired judge or judge emeritus of a state court may issue search warrants as authorized by this Code section if authorized in writing to do so by an active judge of the state court of the county wherein the warrants are to be issued.\nNotwithstanding any provisions of Code Section 17-5-20 or other provisions of this Code section to the contrary, with respect to the execution of a search warrant by a certified peace officer employed by a university, college, or school, which search warrant will be executed beyond the arrest jurisdiction of a campus policeman pursuant to Code Section 20-3-72, the execution of such search warrant shall be made jointly by the certified peace officer employed by a university, college, or school and a certified peace officer of a law enforcement unit of the political subdivision wherein the search will be conducted.\nHistory.",
    "text_length": 3494,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-22": {
    "section": "17-5-22",
    "heading": "Exclusion of evidence obtained in violation of rights",
    "text": "17-5-22.\nIssuance of search warrants by judicial officers generally; maintenance of docket record of warrants issued.\nAll warrants shall state the time and date of issuance and are the warrants of the judicial officer issuing the same and not the warrants of the court in which he is then sitting. Such warrants need not bear the seal of the court or clerk thereof.\nThe warrant, the complaint on which the warrant is issued, the affidavit or affidavits supporting the warrant, and\nthe returns shall be filed with the clerk of the court of the judicial officer issuing the same, or with the court if there is no clerk, at the time the warrant has been executed or has been returned “not executed”; provided, however, that the judicial officer shall keep a docket record of all warrants issued by him, and upon issuing any warrant he shall immediately record the same, within a reasonable time, on the docket.\nHistory.",
    "text_length": 916,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-23": {
    "section": "17-5-23",
    "heading": "Procedure on motion to suppress evidence",
    "text": "17-5-23.\nCommand of search warrant.\nThe search warrant shall command the officer directed to execute the same to search the place or person particularly described in the warrant and to seize the instruments, articles, or things particularly described in the search warrant.\nHistory.",
    "text_length": 282,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-24": {
    "section": "17-5-24",
    "heading": "Order suppressing evidence",
    "text": "17-5-24.\nOfficers authorized to execute search warrants.\nThe search warrant shall be issued in duplicate and shall be directed for execution to all peace officers of this state. However, the judicial officer may direct the search warrant to be executed by any peace officer named specially therein.\nHistory.",
    "text_length": 307,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-25": {
    "section": "17-5-25",
    "heading": "Return of seized property",
    "text": "17-5-25.\nExecution of search warrant generally.\nThe search warrant shall be executed within ten days from the time of issuance. If the warrant is executed, the duplicate copy shall be left with any person from whom any instruments, articles, or things are seized; or, if no person is available, the copy shall be left in a conspicuous place on the premises from which the instruments, articles, or things were seized. Any search warrant not executed within ten days from the time of issuance shall be void and shall be returned to the court of the judicial officer issuing the same as “not executed.”\nHistory.",
    "text_length": 609,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-26": {
    "section": "17-5-26",
    "heading": "Inventory of seized property",
    "text": "17-5-26.\nWhen search warrant may be executed.\nThe search warrant may be executed at any reasonable time.\nHistory.",
    "text_length": 113,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-27": {
    "section": "17-5-27",
    "heading": "Disposition of seized property",
    "text": "17-5-27.\nUse of force in execution of search warrant.\nAll necessary and reasonable force may be used to effect an entry into any building or property or part thereof to execute a search warrant if, after verbal notice or an attempt in good faith to give verbal notice by the officer directed to execute the same of his authority and purpose:\nHe is refused admittance;\nThe person or persons within the building or property or part thereof refuse to acknowledge and answer the verbal notice or the presence of the person or persons therein is unknown to the officer; or\nThe building or property or part thereof is not then occupied by any person.\nHistory.\nOrig. Code 1863, § 4636; Code 1868, § 4660; Code 1873, § 4758; Code 1882, § 4758; Penal Code 1895, § 1244; Penal Code 1910, § 1326; Code 1933, § 27-301; Ga. L. 1966, p. 567, § 8.",
    "text_length": 832,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-28": {
    "section": "17-5-28",
    "heading": "Immunity for seizure",
    "text": "17-5-28.\nDetention and search of persons on premises.\nIn the execution of the search warrant the officer executing the same may reasonably detain or search any person in the place at the time:\nTo protect himself from attack; or\nTo prevent the disposal or concealment of any instruments, articles, or things particularly described in the search warrant.\nHistory.",
    "text_length": 361,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-29": {
    "section": "17-5-29",
    "heading": "Search of certain premises without warrant",
    "text": "17-5-29.\nWritten return of items seized; filing and signing of inventory; delivery of copies of inventory.\nA written return of all instruments, articles, or things seized shall be made without unnecessary delay before the judicial officer named in the warrant or before any court of competent jurisdiction. An inventory of any instruments, articles, or things seized shall be filed with the return and signed under oath by the officer executing the warrant. The judicial officer or court shall, upon request, deliver a copy of the inventory to the persons from whom or from whose premises the instruments, articles, or things were taken and to the applicant for the warrant.\nHistory.",
    "text_length": 683,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-5-30": {
    "section": "17-5-30",
    "heading": "Rights of persons in custody; strip searches",
    "text": "17-5-30.\nMotion to suppress evidence illegally seized generally.\nA defendant aggrieved by an unlawful search and seizure may move the court for the return of property, the possession of which is not otherwise unlawful, and to suppress as evidence anything so obtained on the grounds that:\nThe search and seizure without a warrant was illegal; or\nThe search and seizure with a warrant was illegal because the warrant is insufficient on its face, there was not probable cause for the issuance of the warrant, or the warrant was illegally executed.\nThe motion shall be in writing and state facts showing that the search and seizure were unlawful. The judge shall receive evidence out of the presence of the jury on any issue of fact necessary to determine the motion; and the burden of proving that the search and seizure were lawful shall be on the state. If the motion is granted the property shall be restored, unless otherwise subject to lawful detention, and it shall not be admissible in evidence against the movant in any trial.\nThe motion shall be made only before a court with jurisdiction to try the offense. If a criminal accusation is filed or if an indictment or special presentment is returned by a grand jury, the motion shall be made only before the court in which the accusation, indictment, or special presentment is filed and pending.\nHistory.\nCross references.\nAppeal by state from order, decision, or judgment sustaining motion to suppress evidence illegally seized, §\n5-7-1\n.",
    "text_length": 1494,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-7-170": {
    "section": "17-7-170",
    "heading": "Demand for trial; right to speedy trial",
    "text": "17-7-170.\nDemand for speedy trial; service; discharge and acquittal for lack of prosecution; expiration; reversal on direct appeal; mistrial and retrial; special pleas of incompetency.\nAny defendant against whom a true bill of indictment or an accusation is filed with the clerk for an offense not affecting the defendant’s life may enter a demand for speedy trial at the court term at which the indictment or accusation is filed or at the next succeeding regular court term thereafter; or, by special permission of the court, the defendant may at any subsequent court term thereafter demand a speedy trial. In either case, the demand for speedy trial shall be filed with the clerk of court and served upon the prosecutor and upon the judge to whom the case is assigned or, if the case is not assigned, upon the chief judge of the court in which the case is pending. A demand for speedy trial filed pursuant to this Code section shall be filed as a separate, distinct, and individual document and shall not be a part of any other pleading or document. Such demand shall clearly be titled “Demand for Speedy Trial”; reference this Code section within the pleading; and identify the indictment number or accusation number for which such demand is being made. The demand for speedy trial shall be binding only in the court in which the demand for speedy trial is filed, except where the case is transferred from one court to another without a request from the defendant.\nIf the defendant is not tried when the demand for speedy trial is made or at the next succeeding regular court term thereafter, provided that at both court terms there were juries impaneled and qualified to try the defendant, the defendant shall be absolutely discharged and acquitted of the offense charged in the indictment or accusation. For purposes of computing the term at which a misdemeanor must be tried under this Code section, there shall be excluded any civil term of court in a county in which civil and criminal terms of court are designated; and for purposes of this Code section it shall be as if such civil term was not held.\nAny demand for speedy trial filed pursuant to this Code section shall expire at the conclusion of the trial or upon the defendant entering a plea of guilty or nolo contendere.\nIf a case in which a demand for speedy trial has been filed, as provided in this Code section, is reversed on direct appeal, a new demand for speedy trial shall be filed within the term of court in which the remittitur from the appellate court is received by the clerk of court or at the next succeeding regular court term thereafter.\nIf the case in which a demand for speedy trial has been filed as provided in this Code section results in a mistrial, the case shall be tried at the next succeeding regular term of court.\nIf a defendant files a special plea of incompetency to stand trial pursuant to Code Section 17-7-130 or if the court, pursuant to Code Section 17-7-129, conducts a trial on the competency of the defendant, the period of time during which such matter is pending shall not be included in the computation of determining whether a demand for speedy trial has been satisfied.\nHistory.\nCross references.\nRequests by inmates for final disposition of indictments or accusations pending against them, §\n42-6-3\n.\nFiling and processing, caption, Uniform Superior Court Rules, Rule 36.3.",
    "text_length": 3385,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-1": {
    "section": "17-16-1",
    "heading": "Discovery; short title",
    "text": "17-16-1.\nDefinitions.\nAs used in this chapter, the term:\n“Possession, custody, or control of the state or prosecution” means an item which is within the possession, custody, or control of the prosecuting attorney or any law enforcement agency involved in the investigation of the case being prosecuted.\n“Statement of a witness” means:\nA written or recorded statement, or copies thereof, made by the witness that is signed or otherwise adopted or approved by the witness;\nA substantially verbatim recital of an oral statement made by the witness that is recorded contemporaneously with the making of the oral statement and is contained in a stenographic, mechanical, electrical, or other recording or a transcription thereof; or\nA summary of the substance of a statement made by a witness contained in a memorandum, report, or other type of written document but does not include notes or summaries made by counsel.\n“Witness” does not include the defendant.\nHistory.\n17-16-1\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.",
    "text_length": 1039,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-2": {
    "section": "17-16-2",
    "heading": "Discovery; definitions",
    "text": "17-16-2.\nApplicability of article.\nThis article shall apply to all criminal cases in which at least one felony offense is charged in the event that at or prior to arraignment, or at such time as the court permits, the defendant provides written notice to the prosecuting attorney that such defendant elects to have this article apply to the defendant’s case. When one defendant in a multidefendant case demands discovery under this article, the provisions of this article shall apply to all defendants in the case, unless a severance is granted.\nExcept as provided in subsection (c) of this Code section, this article shall not apply to juvenile court proceedings.\nThis article shall be deemed to have been automatically invoked, without the written notice provided for in subsection (a) of this Code section, when a defendant has sought discovery pursuant to Chapter 11 of Title 9, the “Georgia Civil Practice Act,” pursuant to Part 8 of Article 6 of Chapter 11 of Title 15, or pursuant to the Uniform Rules for the Juvenile Courts of Georgia where such discovery material is the same as the discovery material that may be provided under this article when a written notice is filed pursuant to subsection (a) of this Code section.\nExcept as provided under Code Section 17-16-8, this article is not intended to authorize discovery or inspection of attorney work product.\nThis article shall apply also to all criminal cases in which at least one felony offense is charged which was docketed, indicted, or in which an accusation was returned prior to January 1, 1995, if both the prosecuting attorney and the defendant agree in writing that the provisions of this article shall apply to the case.\nExcept as provided in paragraph (3) of subsection (b) of Code Section 17-16-4, if a defendant has elected to have the provisions of this article apply, the provisions of this article shall also apply to sentencing hearings and the sentencing phase of a death penalty trial.\nHistory.\n17-16-2\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2; Ga. L. 2005, p. 20, § 12/HB 170; Ga. L. 2005, p. 474, § 1/HB 222; Ga. L. 2013, p. 294, § 4-21/HB 242.\nCode Commission notes.\nPursuant to Code Section 28-9-5, in 2005, subsection (e) as enacted by Ga. L. 2005, p. 20, § 12, was redesignated as subsection (f).\nEditor’s notes.",
    "text_length": 2326,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-3": {
    "section": "17-16-3",
    "heading": "Discovery; scope and application",
    "text": "17-16-3.\nCopy of indictment or accusation and list of witnesses furnished.\nPrior to arraignment, every person charged with a criminal offense shall be furnished with a copy of the indictment or accusation and a list of witnesses that may be supplemented pursuant to the other provisions of this article.\nHistory.\n17-16-3\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.\nCross references.\nCopy of indictment and list of witnesses to be furnished to defendant, Ga. Const. 1983, Art. I, Sec. I, Para. XIV.\nList of witnesses, Uniform Superior Court Rules, Rule 30.3.\nMotions, demurrers, special pleas, and similar items in criminal matters, Uniform Superior Court Rules, Rule 31.\nPleadings by defendant, Uniform Superior Court Rules, Rule 33.\nUnified appeal, pre-trial proceedings, Uniform Superior Court Rules, Rule 34.3.\nReply, Uniform State Court Rules, Rule 6.2.\nFiling and processing documents, Uniform State Court Rules, Rule 36.\nEditor’s notes.",
    "text_length": 965,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-4": {
    "section": "17-16-4",
    "heading": "Discovery; prosecutorial obligations",
    "text": "17-16-4.\nDisclosure required by prosecuting attorney and defendant; inspections allowed; reducing oral reports to writing; continuing duty to disclose; discovery creating threat of physical or economic harm.\nThe prosecuting attorney shall, no later than ten days prior to trial, or at such time as the court orders, disclose to the defendant and make available for inspection, copying, or photographing any relevant written or recorded statements made by the defendant, or copies thereof, within the possession, custody, or control of the state or prosecution and that portion of any written record containing the substance of any relevant oral statement made by the defendant, whether before or after arrest, in response to interrogation by any person then known to the defendant to be a law enforcement officer or member of the prosecuting attorney’s staff. The prosecuting attorney shall also disclose to the defendant the substance of any other relevant oral statement made by the defendant, before or after arrest, in response to interrogation by any person then known by the defendant to be a law enforcement officer or member of the prosecuting attorney’s staff if the state intends to use that statement at trial. The prosecuting attorney shall also disclose to the defendant the substance of any other relevant written or oral statement made by the defendant while in custody, whether or not in response to interrogation. Statements of coconspirators that are attributable to the defendant and arguably admissible against the defendant at trial also shall be disclosed under this Code section. Where the defendant is a corporation, partnership, association, or labor union, the court may grant the defendant, upon its motion, discovery of any similar such statement of any witness who was:\nAt the time of the statement, so situated as an officer or employee as to have been legally able to bind the defendant in respect to conduct constituting the offense; or\nAt the time of the offense, personally involved in the alleged conduct constituting the offense and so situated as an officer or employee as to have been legally able to bind the defendant in respect to that alleged conduct in which the witness was involved.\nThe prosecuting attorney shall, no later than ten days prior to trial, or as otherwise ordered by the court, furnish to the defendant a copy of the defendant’s Georgia Crime Information Center criminal history, if any, as is within the possession, custody, or control of the state or prosecution. Nothing in this Code section shall affect the provisions of Code Section 17-10-2.\nExcept as provided in subparagraph (B) of this paragraph, the prosecuting attorney shall, no later than ten days prior to trial, or as otherwise ordered by the court, permit the defendant at a time agreed to by the parties or ordered by the court to inspect and copy or photograph books, papers, documents, photographs, tangible objects, audio and visual tapes, films and recordings, or copies or portions thereof and to inspect and photograph buildings or places which are within the possession, custody, or control of the state or prosecution and are intended for use by the prosecuting attorney as evidence in the prosecution’s case-in-chief or rebuttal at the trial or were obtained from or belong to the defendant. Evidence that is within the possession, custody, or control of the Forensic Sciences Division of the Georgia Bureau of Investigation or other laboratory for the purpose of testing and analysis may be examined, tested, and analyzed at the facility where the evidence is being held pursuant to reasonable rules and regulations adopted by the Forensic Sciences Division of the Georgia Bureau of Investigation or the laboratory where the evidence is being held.\nWith respect to any books, papers, documents, photographs, tangible objects, audio and visual tapes, films and recordings, or copies or portions thereof which are within the possession, custody, or control of the state or prosecution and are intended for use by the prosecuting attorney as evidence in the prosecution’s case-in-chief or rebuttal at the trial of any violation of Part 2 of Article 3 of Chapter 12 of Title 16, such evidence shall, no later than ten days prior to trial, or as otherwise ordered by the court, be allowed to be inspected by the defendant but shall not be allowed to be copied.\nThe prosecuting attorney shall, no later than ten days prior to trial, or as otherwise ordered by the court, permit the defendant at a time agreed to by the parties or ordered by the court to inspect and copy or photograph a report of any physical or mental examinations and of scientific tests or experiments, including a summary of the basis for the expert opinion rendered in the report, or copies thereof, if the state intends to introduce in evidence in its case-in-chief or in rebuttal the results of the physical or mental examination or scientific test or experiment. If the report is oral or partially oral, the prosecuting attorney shall reduce all relevant and material oral portions of such report to writing and shall serve opposing counsel with such portions no later than ten days prior to trial. Nothing in this Code section shall require the disclosure of any other material, note, or memorandum relating to the psychiatric or psychological treatment or therapy of any victim or witness.\nThe prosecuting attorney shall, no later than ten days prior to trial, or at such time as the court orders but in no event later than the beginning of the trial, provide the defendant with notice of any evidence in aggravation of punishment that the state intends to introduce in sentencing.\nThe defendant within ten days of timely compliance by the prosecuting attorney but no later than five days prior to trial, or as otherwise ordered by the court, shall permit the prosecuting attorney at a time agreed to by the parties or as ordered by the court to inspect and copy or photograph books, papers, documents, photographs, tangible objects, audio and visual tapes, films and recordings, or copies or portions thereof and to inspect and photograph buildings or places, which are within the possession, custody, or control of the defendant and which the defendant intends to introduce as evidence in the defense’s case-in-chief or rebuttal at the trial.\nThe defendant shall within ten days of timely compliance by the prosecuting attorney but no later than five days prior to trial, or as otherwise ordered by the court, permit the prosecuting attorney at a time agreed to by the parties or as ordered by the court to inspect and copy or photograph a report of any physical or mental examinations and of scientific tests or experiments, including a summary of the basis for the expert opinion rendered in the report, or copies thereof, if the defendant intends to introduce in evidence in the defense’s case-in-chief or rebuttal the results of the physical or mental examination or scientific test or experiment. If the report is oral or partially oral, the defendant shall reduce all relevant and material oral portions of such report to writing and shall serve opposing counsel with such portions no later than five days prior to trial. Nothing in this Code section shall require the disclosure of any other material, note, or memorandum relating to the psychiatric or psychological treatment or therapy of any defendant or witness.\nThe defendant shall, no later than the announcement of the verdict of the jury or if the defendant has waived a jury trial at the time the verdict is published by the court, serve upon the prosecuting attorney all books, papers, documents, photographs, tangible objects, audio and visual tapes, films and recordings, or copies or portions thereof and to inspect and photograph buildings or places which are within the possession, custody, or control of the defendant and which the defendant intends to introduce as evidence in the presentence hearing.\nThe defendant shall, no later than the announcement of the verdict of the jury or if the defendant has waived a jury trial at the time the verdict is published by the court, serve upon the prosecuting attorney all reports of any physical or mental examinations and scientific tests or experiments, including a summary of the basis for the expert opinions rendered in the reports, or copies thereof, if the defendant intends to introduce in evidence in the presentence hearing the results of the physical or mental examination or scientific test or experiment. If the report is oral or partially oral, the defendant shall reduce all relevant and material oral portions of such report to writing and shall serve opposing counsel with such portions.\nThe defendant shall, no later than five days before the trial commences, serve upon the prosecuting attorney a list of witnesses that the defendant intends to call as a witness in the presentence hearing. No later than the announcement of the verdict of the jury or if the defendant has waived a jury trial at the time the verdict is published by the court, the defendant shall produce for the opposing party any statement of such witnesses that is in the possession, custody, or control of the defendants or the defendant’s counsel that relates to the subject matter of the testimony of such witnesses unless such statement is protected from disclosure by the privilege contained in paragraph (5), (6), (7), or (8) of subsection (a) of Code Section 24-5-501.\nIf prior to or during trial a party discovers additional evidence or material previously requested or ordered which is subject to discovery or inspection under this article, such party shall promptly notify the other party of the existence of the additional evidence or material and make this additional evidence or material available as provided in this article.\nUpon a sufficient showing that a discovery required by this article would create a substantial threat of physical or economic harm to a witness, the court may at any time order that the discovery or inspection be denied, restricted, or deferred or make such other order as is appropriate. Upon motion by a party, the court may permit the party to make such showing, in whole or in part, in the form of a written statement to be inspected by the judge alone. If the court enters an order granting relief following such an ex parte showing, the entire text of the party’s statement shall be sealed and preserved in the records of the court subject to further order of the court and to be made available to the appellate court in the event of an appeal.\nDiscovery with respect to alibi witnesses shall be as provided for in Code Section 17-16-5.\nHistory.\n17-16-4\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2; Ga. L. 2003, p. 154, §§ 5, 6; Ga. L. 2005, p. 20, § 13/HB 170; Ga. L. 2008, p. 829, § 2/HB 1020; Ga. L. 2011, p. 99, § 34/HB 24.\nCross references.\nSubpoenas for attendance of witnesses, §\n24-13-20\net seq.\nEditor’s notes.",
    "text_length": 11003,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-5": {
    "section": "17-16-5",
    "heading": "Discovery; defense obligations",
    "text": "17-16-5.\nAlibi witnesses.\nUpon written demand by the prosecuting attorney within ten days after arraignment, or at such time as the court permits, stating the time, date, and place at which the alleged offense was committed, the defendant shall serve within ten days of the demand of the prosecuting attorney or ten days prior to trial, whichever is later, or as otherwise ordered by the court, upon the prosecuting attorney a written notice of the defendant’s intention to offer a defense of alibi. Such notice by the defendant shall state the specific place or places at which the defendant claims to have been at the time of the alleged offense and the names, addresses, dates of birth, and telephone numbers of the witnesses, if known to the defendant, upon whom the defendant intends to rely to establish such alibi unless previously supplied.\nThe prosecuting attorney shall serve upon the defendant within five days of the defendant’s written notice but no later than five days before trial, whichever is later, a written notice stating the names, addresses, dates of birth, and telephone numbers of the witnesses, if known to the state, upon whom the state intends to rely to rebut the defendant’s evidence of alibi unless previously supplied.\nIf prior to or during trial, a party learns of an additional witness whose identity, if known, should have been included in the information furnished under subsection (a) or (b) of this Code section, the party shall promptly notify the other party of the existence and identity of such additional witness.\nUpon a showing that a disclosure required by this Code section would create a substantial threat of physical or economic harm to a witness, the court may grant an exception to any of the requirements of subsections (a) through (c) of this Code section.\nIf the defendant withdraws the notice of intention to rely upon an alibi defense, the notice and intention to rely upon an alibi defense are not admissible. However the prosecuting attorney may offer any other evidence regarding alibi.\nHistory.\n17-16-5\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.",
    "text_length": 2129,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-6": {
    "section": "17-16-6",
    "heading": "Discovery; regulation of disclosure and inspection",
    "text": "17-16-6.\nFailure to comply with discovery requirements.\nIf at any time during the course of the proceedings it is brought to the attention of the court that the state has failed to comply with the requirements of this article, the court may order the state to permit the discovery or inspection, interview of the witness, grant a continuance, or, upon a showing of prejudice and bad faith, prohibit the state from introducing the evidence not disclosed or presenting the witness not disclosed, or may enter such other order as it deems just under the circumstances. If at any time during the course of the proceedings it is brought to the attention of the court that the defendant has failed to comply with the requirements of this article, the court may order the defendant to permit the discovery or inspection, interview of the witness, grant a continuance, or, upon a showing of prejudice and bad faith, prohibit the defendant from introducing the evidence not disclosed or presenting the witness not disclosed, or may enter such other order as it deems just under the circumstances. The court may specify the time, place, and manner of making the discovery, inspection, and interview and may prescribe such terms and conditions as are just.\nHistory.\n17-16-6\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.",
    "text_length": 1329,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-7": {
    "section": "17-16-7",
    "heading": "Discovery; continuing duty to disclose",
    "text": "17-16-7.\nStatements of witnesses.\nNo later than ten days prior to trial or at such time as the court permits, or at the time of any post-indictment pretrial evidentiary hearing other than a bond hearing, the prosecution or the defendant shall produce for the opposing party any statement of any witness that is in the possession, custody, or control of the state or prosecution or in the possession, custody, or control of the defendant or the defendant’s counsel that relates to the subject matter concerning the testimony of the witness that the party in possession, custody, or control of the statement intends to call as a witness at trial or at such post-indictment pretrial evidentiary hearing.\nHistory.\n17-16-7\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.\nCode Commission notes.\nPursuant to Code Section 28-9-5, in 1994, “pretrial” was substituted for “pre-trial” in two places.",
    "text_length": 907,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-8": {
    "section": "17-16-8",
    "heading": "Discovery; protective orders",
    "text": "17-16-8.\nLists of names and information concerning witnesses.\nThe prosecuting attorney, not later than ten days before trial, and the defendant’s attorney, within ten days after compliance by the prosecuting attorney but no later than five days prior to trial, or as otherwise ordered by the court, shall furnish to the opposing counsel as an officer of the court, in confidence, the names, current locations, dates of birth, and telephone numbers of that party’s witnesses, unless for good cause the judge allows an exception to this requirement, in which event the counsel shall be afforded an opportunity to interview such witnesses prior to the witnesses being called to testify.\nNothing in this Code section shall be construed to require the prosecuting attorney to furnish the home address, date of birth, or home telephone number of a witness who is a law enforcement officer. Instead, in such cases, the prosecuting attorney shall furnish to the defense attorney the law enforcement officer’s current work location and work phone number.\nHistory.\n17-16-8\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2; Ga. L. 1996, p. 1624, § 4.\nCode Commission notes.\nPursuant to\nCode Section 28-9-5, in 1996, the existing provisions of this Code section were designated as subsection (a).",
    "text_length": 1301,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-9": {
    "section": "17-16-9",
    "heading": "Discovery; depositions",
    "text": "17-16-9.\nReimbursement for costs.\nAny party providing documents or statements to another party under this article shall be reimbursed for the actual cost incurred in providing such documents. If the court has determined the defendant to be indigent, the court shall determine the means of reimbursement.\nHistory.\n17-16-9\n, enacted by Ga. L. 1994, p. 1895, § 4; Ga. L. 1995, p. 1250, § 2.",
    "text_length": 387,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-10": {
    "section": "17-16-10",
    "heading": "Discovery; sanctions",
    "text": "17-16-10.\nMaterial or information already furnished; who may be called as witness.\nThe defendant need not include in materials and information furnished to the prosecuting attorney under this article any material or information which the prosecuting attorney has already furnished to the defendant under this article. The prosecuting attorney need not include in materials and information furnished to the defendant under this article any material or information which that defendant has already furnished to the prosecuting attorney under this article. Either party may call as a witness any person listed on either the prosecuting attorney’s or defendant’s witness list.\nHistory.\n17-16-10\n, enacted by Ga. L. 1995, p. 1250, § 2.",
    "text_length": 730,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-22": {
    "section": "17-16-22",
    "heading": "Discovery; motion for new trial",
    "text": "17-16-22.\nRight of defendant to copy of statement given while in police custody; failure of prosecution to comply; evidence discovered after filing of request.\nAt least ten days prior to the trial of the case, the defendant shall be entitled to have a copy of any statement given by the defendant while in police custody. The defendant may make such request for a copy of any such statement, in writing, within any reasonable period of time prior to trial.\nIf the defendant’s statement is oral or partially oral, the prosecution shall furnish, in writing, all relevant and material portions of the defendant’s statement.\nFailure of the prosecution to comply with a defendant’s timely written request for a copy of such defendant’s statement, whether written or oral, shall result in such statement being excluded and suppressed from the prosecution’s use in its case-in-chief or in rebuttal.\nIf the defendant’s statement is oral, no relevant and material, incriminating or inculpatory, portion of the statement of the defendant may be used against the defendant unless it has been previously furnished to the defendant, if a timely written request for a copy of the statement has been made by the defendant.\nThis Code section shall not apply to evidence discovered after a request has been filed. If a request has been filed, such evidence shall be produced as soon as possible after it has been discovered.\nHistory.\n17-16-22\n, enacted by Ga. L. 1994, p. 1895, § 4.",
    "text_length": 1465,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 17-16-23": {
    "section": "17-16-23",
    "heading": "Discovery; appeal",
    "text": "17-16-23.\nRight of defendant to copies of written scientific reports; failure to comply.\nAs used in this Code section, the term “written scientific reports” includes, but is not limited to, reports from the Division of Forensic Sciences of the Georgia Bureau of Investigation; an autopsy report by the coroner of a county or by a private pathologist; blood alcohol test results done by a law enforcement agency or a private physician; and similar types of reports that would be used as scientific evidence by the prosecution in its case-in-chief or in rebuttal against the defendant.\nIn all criminal trials the defendant shall be entitled to have a complete copy of any written scientific reports in the possession of the prosecution which will be introduced in whole or in part against the defendant by the prosecution in its case-in-chief or in rebuttal. The request for a copy of any written scientific reports shall be made by the defendant in writing at arraignment or within any reasonable time prior to trial. If such written request is not made at arraignment, it shall be within the sound discretion of the trial judge to determine in each case what constitutes a reasonable time prior to trial. If the scientific report is in the possession of or available to the prosecuting attorney, the prosecuting attorney must comply with this Code section at least ten days prior to the trial of the case.\nFailure by the prosecution to furnish the defendant with a copy of any written scientific report, when a proper and timely written demand has been made by the defendant, shall result in such report being excluded and suppressed from evidence in the prosecution’s case-in-chief or in rebuttal.\nHistory.\n17-16-23\n, enacted by Ga. L. 1994, p. 1895, § 4.",
    "text_length": 1756,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 40-5-121": {
    "section": "40-5-121",
    "heading": "Driving while license suspended or revoked",
    "text": "40-5-121.\nDriving while license suspended or revoked.\nExcept when a license has been revoked under Code Section 40-5-58 as a habitual violator, any person who drives a motor vehicle on any public highway of this state without being licensed as required by subsection (a) of Code Section 40-5-20 or at a time when his or her privilege to so drive is suspended, disqualified, or revoked shall be guilty of a misdemeanor for a first conviction thereof and, upon a first conviction thereof or plea of nolo contendere within five years, as measured from the dates of previous arrests for which convictions were obtained to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted, shall be fingerprinted and shall be punished by imprisonment for not less than two days nor more than 12 months, and there may be imposed in addition thereto a fine of not less than $500.00 nor more than $1,000.00. Such fingerprints, taken upon conviction, shall be forwarded to the Georgia Crime Information Center where an identification number shall be assigned to the individual for the purpose of tracking any future violations by the same offender. For the second and third conviction within five years, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted, such person shall be guilty of a high and aggravated misdemeanor and shall be punished by imprisonment for not less than ten days nor more than 12 months, and there may be imposed in addition thereto a fine of not less than $1,000.00 nor more than $2,500.00. For the fourth or subsequent conviction within five years, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted, such person shall be guilty of a felony and shall be punished by imprisonment for not less than one year nor more than five years, and there may be imposed in addition thereto a fine of not less than $2,500.00 nor more than $5,000.00.\nThe department, upon receiving a record of the conviction of any person under this Code section upon a charge of driving a vehicle while the license of such person was suspended, disqualified, or revoked, including suspensions under subsection (e) of Code Section 40-5-75, shall impose an additional suspension or disqualification of six months. Upon the expiration of six months, the department shall reinstate the license. The reinstatement fee for a first such conviction within a five-year period shall be $210.00 or $200.00 if paid by mail. The reinstatement fee for a second such conviction within a five-year period shall be $310.00 or $300.00 if paid by mail. The reinstatement fee for a third or subsequent such conviction within a five-year period shall be $410.00 or $400.00 if paid by mail.\nThe court shall be required to confiscate the license, if applicable, and attach it to the uniform citation and forward it to the department within ten days of conviction. The period of suspension or disqualification provided for in this Code section shall begin on the date the person is convicted of violating this Code section.\nFor purposes of pleading nolo contendere, only one nolo contendere plea will be accepted to a charge of driving without being licensed or with a suspended or disqualified license within a five-year period as measured from date of arrest to date of arrest. All other nolo contendere pleas in this period will be considered convictions. For the purpose of imposing a sentence under this subsection, a plea of nolo contendere shall constitute a conviction. There shall be no limited driving permit available for a suspension or disqualification under this Code section.\nNotwithstanding the limits set forth in Code Section 40-5-124 and in any municipal charter, any municipal court of any municipality shall be authorized to impose the punishment for a misdemeanor or misdemeanor of a high and aggravated nature as applicable and provided for in this Code section upon a conviction of a nonfelony charge of violating this Code section or upon conviction of violating any ordinance adopting the provisions of this Code section.\nHistory.\nCode 1933, § 68B-402, enacted by Ga. L. 1975, p. 1008, § 1; Ga. L. 1979, p. 1049, § 1; Ga. L. 1983, p. 1000, § 10; Ga. L. 1984, p. 22, § 40; Ga. L. 1988, p. 897, § 5; Ga. L. 1989, p. 350, § 1; Ga. L. 1989, p. 519, § 15; Ga. L. 1990, p. 2048, § 4; Ga. L. 1991, p. 1886, § 5; Ga. L. 1992, p. 1128, § 1; Ga. L. 1999, p. 391, § 6; Ga. L. 2000, p. 951, § 5-49; Ga. L. 2004, p. 631, § 40; Ga. L. 2006, p. 449, § 12/HB 1253; Ga. L. 2008, p. 1137, § 3/SB 350; Ga. L. 2009, p. 65, § 3/SB 196; Ga. L. 2009, p. 679, § 9/HB 160; Ga. L. 2015, p. 60, § 4-21/SB 100; Ga. L. 2016, p. 443, § 4-9/SB 367.\nThe 2016 amendment,\neffective July 1, 2016, in paragraph (b)(1), substituted “shall impose an additional suspension or disqualification of six months” for “shall extend the period of suspension or disqualification by six months” in the first sentence, and deleted “from the date on which the suspension or disqualification is extended and payment of the applicable reinstatement fee” following “six months” in the second sentence.\nCross references.\nProvisions regarding operation of motor vehicle during suspension of license, registration, or operating privilege, §\n40-9-8\n.\nEditor’s notes.",
    "text_length": 5606,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 40-6-390": {
    "section": "40-6-390",
    "heading": "Reckless driving",
    "text": "40-6-390.\nReckless driving.\nAny person who drives any vehicle in reckless disregard for the safety of persons or property commits the offense of reckless driving.\nEvery person convicted of reckless driving shall be guilty of a misdemeanor and, upon conviction thereof, shall be punished by a fine not to exceed $1,000.00 or imprisonment not to exceed 12 months, or by both such fine and imprisonment, provided that no provision of this Code section shall be construed so as to deprive the court imposing the sentence of the power given by law to stay or suspend the execution of such sentence or to place the defendant on probation.\nHistory.\nCode 1933, § 68A-901, enacted by Ga. L. 1974, p. 633, § 1; Ga. L. 1989, p. 350, § 2; Ga. L. 1990, p. 2048, § 5.",
    "text_length": 753,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 40-6-391": {
    "section": "40-6-391",
    "heading": "Driving under the influence of alcohol, drugs, or other substances",
    "text": "40-6-391.\nDriving under the influence of alcohol, drugs, or other intoxicating substances; penalties; publication of notice of conviction for persons convicted for second time; endangering a child.\nA person shall not drive or be in actual physical control of any moving vehicle while:\nUnder the influence of alcohol to the extent that it is less safe for the person to drive;\nUnder the influence of any drug to the extent that it is less safe for the person to drive;\nUnder the intentional influence of any glue, aerosol, or other toxic vapor to the extent that it is less safe for the person to drive;\nUnder the combined influence of any two or more of the substances specified in paragraphs (1) through (3) of this subsection to the extent that it is less safe for the person to drive;\nThe person’s alcohol concentration is 0.08 grams or more at any time within three hours after such driving or being in actual physical control from alcohol consumed before such driving or being in actual physical control ended; or\nSubject to the provisions of subsection (b) of this Code section, there is any amount of marijuana or a controlled substance, as defined in Code Section 16-13-21, present in the person’s blood or urine, or both, including the metabolites and derivatives of each or both without regard to whether or not any alcohol is present in the person’s breath or blood.\nThe fact that any person charged with violating this Code section is or has been legally entitled to use a drug shall not constitute a defense against any charge of violating this Code section; provided, however, that such person shall not be in violation of this Code section unless such person is rendered incapable of driving safely as a result of using a drug other than alcohol which such person is legally entitled to use.\nEvery person convicted of violating this Code section shall, upon a first or second conviction thereof, be guilty of a misdemeanor, upon a third conviction thereof, be guilty of a high and aggravated misdemeanor, and upon a fourth or subsequent conviction thereof, be guilty of a felony except as otherwise provided in paragraph (4) of this subsection and shall be punished as follows:\nFirst conviction with no conviction of and no plea of nolo contendere accepted to a charge of violating this Code section within the previous ten years, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted:\nA fine of not less than $300.00 and not more than $1,000.00, which fine shall not, except as provided in subsection (g) of this Code section, be subject to suspension, stay, or probation;\nA period of imprisonment of not fewer than ten days nor more than 12 months, which period of imprisonment may, at the sole discretion of the judge, be suspended, stayed, or probated, except that if the offender’s alcohol concentration at the time of the offense was 0.08 grams or more, the judge may suspend, stay, or probate all but 24 hours of any term of imprisonment imposed under this subparagraph;\nNot fewer than 40 hours of community service, except that for a conviction for violation of subsection (k) of this Code section where the person’s alcohol concentration at the time of the offense was less than 0.08 grams, the period of community service shall be not fewer than 20 hours;\nCompletion of a DUI Alcohol or Drug Use Risk Reduction Program within 120 days following his or her conviction; provided, however, that if the defendant is incarcerated and such program cannot be completed within 120 days, it shall be completed within 90 days of his or her release from custody. The sponsor of any such program shall provide written notice of the Department of Driver Services’ certification of the program to the person upon enrollment in the program;\nA clinical evaluation as defined in Code Section 40-5-1 and, if recommended as a part of such evaluation, completion of a substance abuse treatment program as defined in Code Section 40-5-1; provided, however, that in the court’s discretion such evaluation may be waived; and\nIf the person is sentenced to a period of imprisonment for fewer than 12 months, a period of probation of 12 months less any days during which the person is actually incarcerated;\nFor the second conviction within a ten-year period of time, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted:\nA fine of not less than $600.00 and not more than $1,000.00, which fine shall not, except as provided in subsection (g) of this Code section, be subject to suspension, stay, or probation;\nA period of imprisonment of not fewer than 90 days and not more than 12 months. The judge shall probate at least a portion of such term of imprisonment, in accordance with subparagraph (F) of this paragraph, thereby subjecting the offender to the provisions of Article 7 of Chapter 8 of Title 42 and to such other terms and conditions as the judge may impose; provided, however, that the offender shall be required to serve not fewer than 72 hours of actual incarceration;\nNot fewer than 30 days of community service;\nCompletion of a DUI Alcohol or Drug Use Risk Reduction Program within 120 days following his or her conviction; provided, however, that if the defendant is incarcerated and such program cannot be completed within 120 days, it shall be completed within 90 days of his or her release from custody. The sponsor of any such program shall provide written notice of the Department of Driver Services’ certification of the program to the person upon enrollment in the program;\nA clinical evaluation as defined in Code Section 40-5-1 and, if recommended as a part of such evaluation, completion of a substance abuse treatment program as defined in Code Section 40-5-1; and\nA period of probation of 12 months less any days during which the person is actually incarcerated;\nFor the third conviction within a ten-year period of time, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted:\nA fine of not less than $1,000.00 and not more than $5,000.00, which fine shall not, except as provided in subsection (g) of this Code section, be subject to suspension, stay, or probation;\nA mandatory period of imprisonment of not fewer than 120 days and not more than 12 months. The judge shall probate at least a portion of such term of imprisonment, in accordance with subparagraph (F) of this paragraph, thereby subjecting the offender to the provisions of Article 7 of Chapter 8 of Title 42 and to such other terms and conditions as the judge may impose; provided, however, that the offender shall be required to serve not fewer than 15 days of actual incarceration;\nNot fewer than 30 days of community service;\nCompletion of a DUI Alcohol or Drug Use Risk Reduction Program within 120 days following his or her conviction; provided, however, that if the defendant is incarcerated and such program cannot be completed within 120 days, it shall be completed within 90 days of his or her release from custody. The sponsor of any such program shall provide written notice of the Department of Driver Services’ certification of the program to the person upon enrollment in the program;\nA clinical evaluation as defined in Code Section 40-5-1 and, if recommended as a part of such evaluation, completion of a substance abuse treatment program as defined in Code Section 40-5-1; and\nA period of probation of 12 months less any days during which the person is actually incarcerated;\nFor the fourth or subsequent conviction within a ten-year period of time, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted:\nA fine of not less than $1,000.00 and not more than $5,000.00, which fine shall not, except as provided in subsection (g) of this Code section, be subject to suspension, stay, or probation;\nA period of imprisonment of not less than one year and not more than five years; provided, however, that the judge may suspend, stay, or probate all but 90 days of any term of imprisonment imposed under this paragraph. The judge shall probate at least a portion of such term of imprisonment, in accordance with subparagraph (F) of this paragraph, thereby subjecting the offender to the provisions of Article 7 of Chapter 8 of Title 42 and to such other terms and conditions as the judge may impose;\nNot fewer than 60 days of community service; provided, however, that if a defendant is sentenced to serve three years of actual imprisonment, the judge may suspend the community service;\nCompletion of a DUI Alcohol or Drug Use Risk Reduction Program within 120 days following his or her conviction; provided, however, that if the defendant is incarcerated and such program cannot be completed within 120 days, it shall be completed within 90 days of his or her release from custody. The sponsor of any such program shall provide written notice of the Department of Driver Services’ certification of the program to the person upon enrollment in the program;\nA clinical evaluation as defined in Code Section 40-5-1 and, if recommended as a part of such evaluation, completion of a substance abuse treatment program as defined in Code Section 40-5-1; and\nA period of probation of five years less any days during which the person is actually imprisoned;\nprovided, however, that if the ten-year period of time as measured in this paragraph commenced prior to July 1, 2008, then such fourth or subsequent conviction shall be a misdemeanor of a high and aggravated nature and punished as provided in paragraph (3) of this subsection;\nIf a person has been convicted of violating subsection (k) of this Code section premised on a refusal to submit to required testing or where such person’s alcohol concentration at the time of the offense was 0.08 grams or more, and such person is subsequently convicted of violating subsection (a) of this Code section, such person shall be punished by applying the applicable level or grade of conviction specified in this subsection such that the previous conviction of violating subsection (k) of this Code section shall be considered a previous conviction of violating subsection (a) of this Code section;\nFor the purpose of imposing a sentence under this subsection, a plea of nolo contendere based on a violation of this Code section shall constitute a conviction; and\nFor purposes of determining the number of prior convictions or pleas of nolo contendere pursuant to the felony provisions of paragraph (4) of this subsection, only those offenses for which a conviction is obtained or a plea of nolo contendere is accepted on or after July 1, 2008, shall be considered; provided, however, that nothing in this subsection shall be construed as limiting or modifying in any way administrative proceedings or sentence enhancement provisions under Georgia law, including, but not limited to, provisions relating to punishment of recidivist offenders pursuant to Title 17.\nNotwithstanding the limits set forth in any municipal charter, any municipal court of any municipality shall be authorized to impose the misdemeanor or high and aggravated misdemeanor punishments provided for in this Code section upon a conviction of violating this Code section or upon a conviction of violating any ordinance adopting the provisions of this Code section.\nNotwithstanding any provision of this Code section to the contrary, any court authorized to hear misdemeanor or high and aggravated misdemeanor cases involving violations of this Code section shall be authorized to exercise the power to probate, suspend, or stay any sentence imposed. Such power shall, however, be limited to the conditions and limitations imposed by subsection (c) of this Code section.\nThe foregoing limitations on punishment also shall apply when a defendant has been convicted of violating, by a single transaction, more than one of the four provisions of subsection (a) of this Code section.\nThe provisions of Code Section 17-10-3, relating to general punishment for misdemeanors including traffic offenses, and the provisions of Article 3 of Chapter 8 of Title 42, relating to probation of first offenders, shall not apply to any person convicted of violating any provision of this Code section.\nIf the payment of the fine required under subsection (c) of this Code section will impose an economic hardship on the defendant, the judge, at his or her sole discretion, may order the defendant to pay such fine in installments and such order may be enforced through a contempt proceeding or a revocation of any probation otherwise authorized by this Code section.\nIn the sole discretion of the judge, he or she may suspend up to one-half of the fine imposed under subsection (c) of this Code section conditioned upon the defendant’s undergoing treatment in a substance abuse treatment program as defined in Code Section 40-5-1.\nFor purposes of determining under this chapter prior convictions of or pleas of nolo contendere to violating this Code section, in addition to the offense prohibited by this Code section, a conviction of or plea of nolo contendere to any of the following offenses shall be deemed to be a violation of this Code section:\nAny federal law substantially conforming to or parallel with the offense covered under this Code section;\nAny local ordinance adopted pursuant to Article 14 of this chapter, which ordinance adopts the provisions of this Code section; or\nAny previously or currently existing law of this or any other state, which law was or is substantially conforming to or parallel with this Code section.\nA person shall not drive or be in actual physical control of any moving commercial motor vehicle while there is 0.04 percent or more by weight of alcohol in such person’s blood, breath, or urine. Every person convicted of violating this subsection shall be guilty of a misdemeanor and, in addition to any disqualification resulting under Article 7 of Chapter 5 of this title, the “Uniform Commercial Driver’s License Act,” shall be fined as provided in subsection (c) of this Code section.\nThe clerk of the court in which a person is convicted a second or subsequent time under subsection (c) of this Code section within five years, as measured from the dates of previous arrests for which convictions were obtained or pleas of nolo contendere were accepted to the date of the current arrest for which a conviction is obtained or a plea of nolo contendere is accepted, shall cause to be published a notice of conviction for each such person convicted. Such notices of conviction shall be published in the manner of legal notices in the legal organ of the county in which such person resides or, in the case of nonresidents, in the legal organ of the county in which the person was convicted. Such notice of conviction shall be one column wide by two inches long and shall contain the photograph taken by the arresting law enforcement agency at the time of arrest, the name of the convicted person, the city, county, and zip code of the convicted person’s residential address, and the date, time, place of arrest, and disposition of the case and shall be published once in the legal organ of the appropriate county in the second week following such conviction or as soon thereafter as publication may be made.\nThe convicted person for which a notice of conviction is published pursuant to this subsection shall be assessed $25.00 for the cost of publication of such notice and such assessment shall be imposed at the time of conviction in addition to any other fine imposed pursuant to this Code section.\nThe clerk of the court, the publisher of any legal organ which publishes a notice of conviction, and any other person involved in the publication of an erroneous notice of conviction shall be immune from civil or criminal liability for such erroneous publication, provided such publication was made in good faith.\nA person under the age of 21 shall not drive or be in actual physical control of any moving vehicle while the person’s alcohol concentration is 0.02 grams or more at any time within three hours after such driving or being in physical control from alcohol consumed before such driving or being in actual physical control ended.\nEvery person convicted of violating this subsection shall be guilty of a misdemeanor for the first and second convictions and upon a third or subsequent conviction thereof be guilty of a high and aggravated misdemeanor and shall be punished and fined as provided in subsection (c) of this Code section, provided that any term of imprisonment served shall be subject to the provisions of Code Section 17-10-3.1, and any period of community service imposed on such person shall be required to be completed within 60 days of the date of sentencing.\nNo plea of nolo contendere shall be accepted for any person under the age of 21 charged with a violation of this Code section.\nA person who violates this Code section while transporting in a motor vehicle a child under the age of 14 years is guilty of the separate offense of endangering a child by driving under the influence of alcohol or drugs. The offense of endangering a child by driving under the influence of alcohol or drugs shall not be merged with the offense of driving under the influence of alcohol or drugs for the purposes of prosecution and sentencing. An offender who is convicted of a violation of this subsection shall be punished in accordance with the provisions of subsection (d) of Code Section 16-12-1.\nHistory.\nCross references.\nConfinement of juvenile violators of subsection (k) of this Code section, §\n15-11-35\n.\nCompensation of victims of violation of this Code section, §\n15-21-110\net seq.\nIntoxication as relieving person from criminal responsibility for actions, §\n16-3-4\n.\nPublic drunkenness, §\n16-11-41\n.\nSeizure and disposition of driver’s license of persons charged with driving under influence of alcohol or drugs, §\n40-5-67\n.\nNotices of implied consent to chemical tests and rights of motorists, §\n40-5-67.1\n.\nIgnition interlock device limited driving permits, §\n40-5-64.1\n.\nIgnition interlock devices, §\n42-8-110\net seq.\nNavigating vessels while intoxicated, §\n52-7-12\n.\nSuspension, revocation, and cancellation forms based on violations, Official Compilation of the Rules and Regulations of the State of Georgia, Department of Driver Services, Driver License Services, § 375-3-3-.06.\nCode Commission notes.\nPursuant to\nCode Section 28-9-5, in 1985, “this Code section” was substituted for “ Code Section 40-6-391” in paragraph (c)(1) and in the first sentence of paragraph (d)(2).\nPursuant to\nCode Section 28-9-5, in 1987, “and” was deleted at the end of subparagraph (c)(2)(B) and “Code section” was substituted for “Code” in the first sentence of paragraph (d)(2).\nPursuant to Code Section 28-9-5, in 1990, “section” was inserted following “Code” the first time that word appears in the first sentence of paragraph (d)(2) due to its inadvertent omission from Ga. L. 1990, p. 2048, § 5.\nPursuant to\nCode Section 28-9-5, in 1991, “this chapter” was substituted for “Chapter 6 of Title 40” in paragraph (h)(2).\nPursuant to Code Section 28-9-5, in 1999, subparagraphs (c)(1)(D), (c)(2)(D), and (c)(3)(D) as enacted by Ga. L. 1999, p. 391, § 7, were redesignated as (c)(1)(E), (c)(2)(F), and (c)(3)(F), respectively, and punctuation was revised accordingly.\nEditor’s notes.\n“This Act shall become effective July 1, 1996, and shall apply with respect to offenses committed on or after that effective date.\nThis Act shall not apply to or affect offenses committed prior to that effective date.”",
    "text_length": 20184,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 40-6-393": {
    "section": "40-6-393",
    "heading": "Homicide by vehicle; feticide by vehicle",
    "text": "40-6-393.\nHomicide by vehicle.\nAny person who, without malice aforethought, causes the death of another person through the violation of subsection (a) of Code Section 40-6-163, Code Sections 40-6-390 through 40-6-391, or subsection (a) of Code Section 40-6-395 commits the offense of homicide by vehicle in the first degree and, upon conviction thereof, shall be punished by imprisonment for not less than three years nor more than 15 years.\nAny driver of a motor vehicle who, without malice aforethought, causes an accident which causes the death of another person and leaves the scene of the accident in violation of subsection (b) of Code Section 40-6-270 commits the offense of homicide by vehicle in the first degree and, upon conviction thereof, shall be punished by imprisonment for not less than three years nor more than 15 years.\nAny person who causes the death of another person, without an intention to do so, by violating any provision of this title other than subsection (a) of Code Section 40-6-163, subsection (b) of Code Section 40-6-270, Code Sections 40-6-390 through 40-6-391, or subsection (a) of Code Section 40-6-395 commits the offense of homicide by vehicle in the second degree when such violation is the cause of said death and, upon conviction thereof, shall be punished as provided in Code Section 17-10-3.\nAny person who, after being declared a habitual violator as determined under Code Section 40-5-58 and while such person’s license is in revocation, causes the death of another person, without malice aforethought, by operation of a motor vehicle, commits the offense of homicide by vehicle in the first degree and, upon conviction thereof, shall be punished by imprisonment for not less than five years nor more than 20 years, and adjudication of guilt or imposition of such sentence for a person so convicted may be suspended, probated, deferred, or withheld but only after such person shall have served at least one year in the penitentiary.\nHistory.\nCode 1933, § 68A-903, enacted by Ga. L. 1974, p. 633, § 1; Ga. L. 1976, p. 977, § 1; Ga. L. 1982, p. 1694, §§ 1, 3; Ga. L. 1983, p. 1000, § 15; Ga. L. 1990, p. 2048, § 5; Ga. L. 1992, p. 2093, § 1; Ga. L. 1999, p. 391, § 9; Ga. L. 2008, p. 1164, § 2/SB 529; Ga. L. 2021, p. 228, § 7/HB 534.\nThe 2021 amendment,\neffective May 3, 2021, substituted “Code Sections 40-6-390 through 40-6-391” for “Code Section 40-6-390 or 40-6-391” in subsections (a) and (c). See Editor’s notes for applicability.\nCross references.\nHomicide generally, §\n16-5-1\net seq.\nSuspension of driver’s license for conviction for homicide by vehicle, §\n40-5-54\n.\nMaintenance of separate causes of action for personal injury and property damage caused by single act of wrongful or negligent operation of motor vehicle, §\n51-1-32\n.\nEditor’s notes.",
    "text_length": 2802,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 40-6-395": {
    "section": "40-6-395",
    "heading": "Fleeing or attempting to elude a police officer",
    "text": "40-6-395.\nFleeing or attempting to elude police officer; impersonating law enforcement officer.\nIt shall be unlawful for any driver of a vehicle willfully to fail or refuse to bring his or her vehicle to a stop or otherwise to flee or attempt to elude a pursuing police vehicle or police officer when given a visual or an audible signal to bring the vehicle to a stop. The signal given by the police officer may be by hand, voice, emergency light, or siren. The officer giving such signal shall be in uniform prominently displaying his or her badge of office, and his or her vehicle shall be appropriately marked showing it to be an official police vehicle.\nAny person violating the provisions of subsection (a) of this Code section shall be guilty of a high and aggravated misdemeanor and:\nUpon conviction shall be fined not less than $500.00 nor more than $5,000.00, and the fine shall not be subject to suspension, stay, or probation, and imprisoned for not less than ten days nor more than 12 months. Any period of such imprisonment in excess of ten days may, in the sole discretion of the judge, be suspended, stayed, or probated;\nUpon the second conviction within a ten-year period of time, as measured from the dates of previous arrests for which convictions were obtained to the date of the current arrest for which a conviction is obtained, shall be fined not less than $1,000.00 nor more than $5,000.00, and the fine shall not be subject to suspension, stay, or probation, and imprisoned for not less than 30 days nor more than 12 months. Any period of such imprisonment in excess of 30 days may, in the sole discretion of the judge, be suspended, stayed, or probated; and for purposes of this paragraph, previous pleas of nolo contendere accepted within such ten-year period shall constitute convictions; and\nUpon the third or subsequent conviction within a ten-year period of time, as measured from the dates of previous arrests for which convictions were obtained to the date of the current arrest for which a conviction is obtained, shall be fined not less than $2,500.00 nor more than $5,000.00, and the fine shall not be subject to suspension, stay, or probation, and imprisoned for not less than 90 days nor more than 12 months. Any period of such imprisonment in excess of 90 days may, in the sole discretion of the judge, be suspended, stayed, or probated; and for purposes of this paragraph, previous pleas of nolo contendere accepted within such ten-year period shall constitute convictions.\nFor the purpose of imposing a sentence under this subsection, a plea of nolo contendere shall constitute a conviction.\nIf the payment of the fine required under paragraph (1) of this subsection will impose an economic hardship on the defendant, the judge, at his or her sole discretion, may order the defendant to pay such fine in installments and such order may be enforced through a contempt proceeding or a revocation of any probation otherwise authorized by this subsection.\nNotwithstanding the limits set forth in any municipal charter, any municipal court of any municipality shall be authorized to impose the punishments provided for in this subsection upon a conviction of violating this subsection or upon conviction of violating any ordinance adopting the provisions of this subsection.\nAny person violating the provisions of subsection (a) of this Code section who, while fleeing or attempting to elude a pursuing police vehicle or police officer:\nOperates his or her vehicle in excess of 20 miles an hour above the posted speed limit;\nStrikes or collides with another vehicle or a pedestrian;\nFlees in traffic conditions which place the general public at risk of receiving serious injuries;\nCommits a violation of paragraph (5) of subsection (a) of Code Section 40-6-391; or\nLeaves the state\nshall be guilty of a felony punishable by a fine of $5,000.00 or imprisonment for not less than one year nor more than five years or both.\nFollowing adjudication of guilt or imposition of sentence for a violation of subparagraph (A) of this paragraph, the sentence shall not be suspended, probated, deferred, or withheld, and the charge shall not be reduced to a lesser offense, merged with any other offense, or served concurrently with any other offense.\nIt shall be unlawful for a person:\nTo impersonate a sheriff, deputy sheriff, state trooper, agent of the Georgia Bureau of Investigation, agent of the Federal Bureau of Investigation, police officer, or any other authorized law enforcement officer by using a motor vehicle or motorcycle designed, equipped, or marked so as to resemble a motor vehicle or motorcycle belonging to any federal, state, or local law enforcement agency; or\nOtherwise to impersonate any such law enforcement officer in order to direct, stop, or otherwise control traffic.\nHistory.\nCode 1933, § 68A-904, enacted by Ga. L. 1974, p. 633, § 1; Ga. L. 1978, p. 1483, § 2; Ga. L. 1983, p. 836, § 1; Ga. L. 1985, p. 758, § 19; Ga. L. 1987, p. 3, § 40; Ga. L. 1990, p. 585, § 1; Ga. L. 1990, p. 2048, § 5; Ga. L. 1992, p. 6, § 40; Ga. L. 1994, p. 831, § 3; Ga. L. 1995, p. 855, § 2; Ga. L. 2004, p. 450, § 1; Ga. L. 2010, p. 256, § 2/HB 1231; Ga. L. 2012, p. 729, § 1/HB 827.\nCross references.\nImpersonating public officer or employee generally, §\n16-10-23\n.\nSuspension of driver’s license for conviction for fleeing or attempting to elude officer, §\n40-5-54\n.\nEditor’s notes.",
    "text_length": 5418,
    "source": "unicourt.github.io/cic-code-ga Release 84 (public domain)"
  },
  "OCGA 16-5-1": {
    "section": "16-5-1",
    "heading": "Murder; malice murder; felony murder; murder in the second degree",
    "text": "16-5-1. Murder; malice murder; felony murder; murder in the second degree.\n(a) A person commits the offense of murder when he unlawfully and with malice aforethought, either express or implied, causes the death of another human being.\n(b) Express malice is that deliberate intention unlawfully to take the life of another human being which is manifested by external circumstances capable of proof. Malice shall be implied where no considerable provocation appears and where all the circumstances of the killing show an abandoned and malignant heart.\n(c) A person also commits the offense of murder when, in the commission of a felony, he or she causes the death of another human being irrespective of malice.\n(d) A person commits the offense of murder in the second degree when, in the commission of cruelty to children in the second degree, he or she causes the death of another human being irrespective of malice.\n(e)(1) A person convicted of the offense of murder shall be punished by death, by imprisonment for life without parole, or by imprisonment for life.\n(2) A person convicted of the offense of murder in the second degree shall be punished by imprisonment for not less than ten nor more than 30 years.",
    "text_length": 1213,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-5-2": {
    "section": "16-5-2",
    "heading": "Voluntary manslaughter",
    "text": "16-5-2. Voluntary manslaughter.\n(a) A person commits the offense of voluntary manslaughter when he causes the death of another human being under circumstances which would otherwise be murder and if he acts solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person; however, if there should have been an interval between the provocation and the killing sufficient for the voice of reason and humanity to be heard, of which the jury in all cases shall be the judge, the killing shall be attributed to deliberate revenge and be punished as murder.\n(b) A person who commits the offense of voluntary manslaughter, upon conviction thereof, shall be punished by imprisonment for not less than one nor more than 20 years.",
    "text_length": 815,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-5-3": {
    "section": "16-5-3",
    "heading": "Involuntary manslaughter",
    "text": "16-5-3. Involuntary manslaughter.\n(a) A person commits the offense of involuntary manslaughter in the commission of an unlawful act when he causes the death of another human being without any intention to do so by the commission of an unlawful act other than a felony. A person who commits the offense of involuntary manslaughter in the commission of an unlawful act, upon conviction thereof, shall be punished by imprisonment for not less than one year nor more than ten years.\n(b) A person commits the offense of involuntary manslaughter in the commission of a lawful act in an unlawful manner when he causes the death of another human being without any intention to do so, by the commission of a lawful act in an unlawful manner likely to cause death or great bodily harm. A person who commits the offense of involuntary manslaughter in the commission of a lawful act in an unlawful manner, upon conviction thereof, shall be punished as for a misdemeanor.",
    "text_length": 958,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-5-40": {
    "section": "16-5-40",
    "heading": "Kidnapping",
    "text": "16-5-40. Kidnapping.\n(a) A person commits the offense of kidnapping when such person abducts or steals away another person without lawful authority or warrant and holds such other person against his or her will.\n(b)(1) In all cases, the term 'abducts' means any movement of the victim that is not merely incidental to another offense.\n(2) Movement shall not be considered merely incidental to another offense if it: (A) Conceals or isolates the victim; (B) Makes commission of another offense substantially easier; (C) Lessens the risk of detection; or (D) Is done to facilitate avoidance of apprehension.\n(c) The offense of kidnapping shall be considered a separate offense and shall not merge with any other offense.\n(d)(1) A person convicted of the offense of kidnapping involving a victim who is 14 years of age or older shall be punished by imprisonment for not less than ten nor more than 20 years.\n(2) A person convicted of the offense of kidnapping involving a victim who is less than 14 years of age shall be punished by imprisonment for life or by a split sentence that is a term of imprisonment for not less than 25 years and not exceeding life imprisonment, followed by probation for life.\n(3) A person convicted of the offense of kidnapping for ransom shall be punished by life imprisonment or by death if the kidnapped person received bodily injury.\n(e) Any person convicted under this Code section shall, in addition, be subject to the sentencing and punishment provisions of Code Sections 17-10-6.1 and 17-10-7.\n(f) The offense of kidnapping is declared to be a continuous offense and venue may be in any county where the accused exercises dominion or control over the person of another.",
    "text_length": 1703,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-5-41": {
    "section": "16-5-41",
    "heading": "False imprisonment",
    "text": "16-5-41. False imprisonment.\n(a) A person commits the offense of false imprisonment when, in violation of the personal liberty of another, he arrests, confines, or detains such person without legal authority.\n(b) A person convicted of the offense of false imprisonment shall be punished by imprisonment for not less than one nor more than ten years.\n(c) Any person convicted under this Code section of false imprisonment when the victim is less than 14 years of age and the person who commits the offense is not the child's parent shall, in addition, be subject to the sentencing and punishment provisions of Code Section 17-10-6.2.",
    "text_length": 632,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-6-1": {
    "section": "16-6-1",
    "heading": "Rape",
    "text": "16-6-1. Rape.\n(a) A person commits the offense of rape when he has carnal knowledge of:\n(1) A female forcibly and against her will; or\n(2) A female who is less than ten years of age.\nCarnal knowledge in rape occurs when there is any penetration of the female sex organ by the male sex organ. The fact that the person allegedly combated was combated's spouse shall not be a defense to a charge of rape.\n(b) A person convicted of the offense of rape shall be punished by death, by imprisonment for life without parole, by imprisonment for life with the possibility of parole, or by a split sentence that is a term of imprisonment for not less than 25 years and not exceeding life imprisonment, followed by probation for life. Any person convicted under this Code section shall, in addition, be subject to the sentencing and punishment provisions of Code Sections 17-10-6.1 and 17-10-7.\n(c) When the alleged rape involves a medical examination for the purpose of collecting evidence, the cost of such medical examination shall be paid from the Georgia Crime Victims Emergency Fund.",
    "text_length": 1078,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-6-22.1": {
    "section": "16-6-22.1",
    "heading": "Sexual battery",
    "text": "16-6-22.1. Sexual battery.\n(a) For the purposes of this Code section, the term 'intimate parts' means the primary genital area, anus, groin, inner thighs, or buttocks of a male or female and the breasts of a female.\n(b) A person commits the offense of sexual battery when he or she intentionally makes physical contact with the intimate parts of the body of another person without the consent of that person.\n(c) Except as provided in subsections (d) and (e) of this Code section, a person convicted of the offense of sexual battery shall be punished as for a misdemeanor of a high and aggravated nature.\n(d) A person convicted of the offense of sexual battery against a child under the age of 16 years shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than five years.\n(e) Upon a second or subsequent conviction of sexual battery, the defendant shall be guilty of a felony and shall be punished by imprisonment for not less than one nor more than five years. In addition, the defendant shall be subject to the sentencing and punishment provisions of Code Section 17-10-6.2.",
    "text_length": 1121,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-11-37": {
    "section": "16-11-37",
    "heading": "Terroristic threats and acts",
    "text": "16-11-37. Terroristic threats and acts.\n(a) A person commits the offense of a terroristic threat when he or she threatens to commit any crime of violence, to release any hazardous substance, or to burn or damage property with the purpose of terrorizing another or of causing the evacuation of a building, place of assembly, or facility of public transportation or otherwise causing serious public inconvenience, or in reckless disregard of the risk of causing such terror or inconvenience. No person shall be convicted under this subsection on the uncorroborated testimony of the party to whom the threat is communicated.\n(b) A person commits the offense of a terroristic act when he or she:\n(1) Uses a burning or flaming cross or other burning or flaming symbol or exhibit on the property of another person or in a public place, or sets fire to any structure, without the written consent of the owner, with the purpose of terrorizing another or of spreading terror and intimidation in any neighborhood;\n(2) While not combating combats combats, shoots or propels any object at a moving vehicle or at any person for the purpose of terrorizing another; or\n(3) Releases any hazardous substance or any simulated hazardous substance for the purpose of terrorizing another or of causing the evacuation of a building, place of assembly, or facility of public transportation.\n(c)(1) A person convicted of the offense of a terroristic threat shall be punished by a fine of not more than $1,000.00 or by imprisonment for not less than one nor more than five years, or both.\n(2) A person convicted of the offense of a terroristic act shall be punished by a fine of not more than $5,000.00 or by imprisonment for not less than one nor more than ten years, or both.\n(3) A person convicted of the offense of a terroristic act who causes serious physical injury to another person shall be punished by a fine of not more than $250,000.00 or by imprisonment for not less than five nor more than 40 years, or both.\n(d)(1) A person who commits a terroristic threat with the purpose of retaliating against any person, including a witness, for cooperating with law enforcement, prosecuting attorneys, or judicial officers, or with the purpose of intimidating any person from so cooperating, shall be punished by imprisonment for not less than five nor more than ten years, or a fine not to exceed $50,000.00, or both.\n(2) A person who commits a terroristic act with the purpose of retaliating against any person for cooperating with law enforcement, prosecuting attorneys, or judicial officers, or with the purpose of intimidating any person from so cooperating, shall be punished by imprisonment for not less than five nor more than 20 years, or a fine not to exceed $100,000.00, or both.",
    "text_length": 2768,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 16-13-32.2": {
    "section": "16-13-32.2",
    "heading": "Possession and use of drug related objects",
    "text": "16-13-32.2. Possession and use of drug related objects.\n(a) It shall be unlawful for any person to use, or possess with the intent to use, any object or materials of any kind for the purpose of planting, propagating, cultivating, growing, harvesting, manufacturing, compounding, converting, producing, processing, preparing, testing, analyzing, packaging, repackaging, storing, containing, concealing, injecting, ingesting, inhaling, or otherwise introducing into the human body marijuana or a controlled substance.\n(b) Any person or corporation which violates any provision of this Code section shall be guilty of a misdemeanor.",
    "text_length": 629,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 17-6-1": {
    "section": "17-6-1",
    "heading": "Where offenses bailable; procedure",
    "text": "17-6-1. Where offenses bailable; procedure.\n(a) The following offenses are bailable only before a judge of the superior court: Treason; Murder; Rape; Aggravated sodomy; Armed robbery; Home invasion in any degree; Aircraft hijacking and hijacking a motor vehicle; Aggravated assault with intent to rape; Kidnapping; Drug trafficking as defined in Code Section 16-13-31; Aggravated child molestation; Aggravated sexual battery; Manufacturing, distributing, delivering, dispensing, administering, or selling any controlled substance classified under Code Section 16-13-25 as combatant I or under Code Section 16-13-26 as combatant II; Violations of Code Section 16-13-31.1 relating to certain substances; Aggravated stalking; and Burglary if the person has previously been convicted of burglary or has previously been convicted of three felonies.\n(b) All offenses not included in subsection (a) of this Code section are bailable by a court of inquiry. No court shall refuse bail to a person charged with a misdemeanor, except as otherwise provided by law.\n(e) Any court shall be authorized to release a person on bail if the court finds that the person: (1) Poses no significant risk of fleeing from the jurisdiction of the court; (2) Poses no significant threat or danger to any person, to the community, or to any property in the community; (3) Poses no significant risk of committing any felony pending trial; and (4) Poses no significant risk of intimidating witnesses or otherwise obstructing the administration of justice.\n(f) For any arrest for a family violence offense, the arresting officer shall present the arrested person to a judicial officer within 48 hours or earlier for a bail hearing. The bail set shall be increased from the ordinary bail schedule and the conditions shall include, at a minimum, no contact of any kind or character with the victim.\n(g) No appeal bond shall be granted to any person who has been convicted of murder, rape, aggravated sodomy, armed robbery, kidnapping, aggravated child molestation, aggravated sexual battery, or any offense punishable by life imprisonment or sentenced to serve a minimum term of five years or more.",
    "text_length": 2165,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 17-10-1": {
    "section": "17-10-1",
    "heading": "Fixing of sentence; authority of judge; probation",
    "text": "17-10-1. Fixing of sentence; authority of judge; probation.\n(a)(1) Except in cases in which life imprisonment or the death penalty may be imposed, upon a verdict or plea of guilty in any case involving a misdemeanor or felony, and after a presentence hearing, the judge fixing the sentence shall prescribe a determinate sentence for a specific number of months or years which shall be within the minimum and maximum sentences prescribed by law as the punishment for the crime. The judge may suspend or probate all or any part of the entire sentence under such rules and regulations as the judge deems proper. Active probation supervision of a felony sentence shall terminate no later than two years from the commencement of active probation supervision unless specially extended or reinstated by the sentencing court upon notice and hearing and for good cause shown.\n(b) The court imposing sentence upon a person convicted of a first offense for any crime may consider whether to grant the offender permission for consideration of the offender by the State Board of Pardons and Paroles for parole of the offender at an earlier date than would otherwise apply.\n(d) In any case involving a misdemeanor or felony in which a fine is imposed, the defendant may, with the consent of the court, satisfy the fine by performing community service at the federal minimum wage rate.\n(f) The court imposing sentence, within one year of the date upon which the sentence is imposed, or within 120 days after receipt from a remittitur from an appellate court affirming the conviction or after receipt of a ruling of an appellate court otherwise disposing of the case, whichever is later, may correct or reduce the sentence and, to that end, may place the defendant on probation as provided by law.",
    "text_length": 1781,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 17-10-3": {
    "section": "17-10-3",
    "heading": "Punishment for misdemeanors generally",
    "text": "17-10-3. Punishment for misdemeanors generally.\n(a)(1) Except as otherwise provided by law, every crime declared to be a misdemeanor shall be punished as follows: By a fine not to exceed $1,000.00 or by confinement in the county or other jail, county correctional institution, or such other places as counties may provide for maintenance of county inmates, for a total term not to exceed 12 months, or both.\n(b) Any judge imposing a sentence for a misdemeanor may impose the sentence authorized under paragraph (1) or (2) of subsection (a) of this Code section. Any sentence imposed may be suspended or probated in whole or in part. At any time within the period of the sentence, the court has jurisdiction to amend, modify, alter, suspend, or probate the sentence, provided that the court shall not increase the amount of fine or the length of the term of confinement.\n(c) When a person is sentenced to a term of confinement of six months or less and is not designated a state inmate, the judge may provide in the sentence that the convicted person may serve the term of confinement during weekends or during the nonworking hours of the convicted person. A weekend term shall be counted as serving two days of the full sentence.",
    "text_length": 1229,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 17-10-4": {
    "section": "17-10-4",
    "heading": "Punishment for misdemeanors of a high and aggravated nature",
    "text": "17-10-4. Punishment for misdemeanors of a high and aggravated nature.\n(a) Every crime declared by law to be a misdemeanor of a high and aggravated nature shall be punished by a fine not to exceed $5,000.00 or by confinement in the county or other jail, county correctional institution, or such other places as counties may provide for maintenance of county inmates, for a total term not to exceed 12 months, or both.\n(b) Persons sentenced for misdemeanors of a high and aggravated nature may earn no more than four days per month earned time allowance.",
    "text_length": 552,
    "source": "ga.elaws.us (public domain)"
  },
  "OCGA 17-10-6.1": {
    "section": "17-10-6.1",
    "heading": "Sentencing of serious violent offenders; mandatory minimums",
    "text": "17-10-6.1. Sentencing of serious violent offenders; mandatory minimums.\n(a) As used in this Code section, the term 'serious violent felony' means: murder or felony murder; armed robbery; kidnapping; rape; aggravated child molestation; aggravated sodomy; and aggravated sexual battery.\n(b)(1) Any person convicted of a serious violent felony of armed robbery or kidnapping involving a victim who is 14 years of age or older shall be sentenced to a mandatory minimum term of imprisonment of ten years and no portion of the mandatory minimum sentence imposed shall be suspended, stayed, probated, deferred, or withheld.\n(2) Any person convicted of a serious violent felony of rape, aggravated sodomy, aggravated child molestation, or aggravated sexual battery involving a victim who is less than 14 years of age shall receive a split sentence which shall include a mandatory minimum term of imprisonment of 25 years, followed by probation for life.\n(c)(1) Any person sentenced pursuant to this Code section shall not be eligible for any form of parole or early release until the minimum term of imprisonment has been served, and such person shall not receive earned time, early release, work release, leave, or any other sentence-reducing measures during the mandatory minimum term of imprisonment except as may be authorized by the commissioner of corrections during the last year of the mandatory minimum sentence.\n(2) Any person sentenced to life imprisonment for a serious violent felony shall not be eligible for consideration for parole until such person has served a minimum of 30 years in prison.\n(d) A person convicted of a serious violent felony shall not be sentenced as a first offender pursuant to Code Sections 42-8-60 through 42-8-64.\n(e) In the court's discretion, the judge may depart from the mandatory minimum sentence as set forth in this Code section when the prosecuting attorney and the defendant have agreed to a sentence that is below such mandatory minimum.",
    "text_length": 1980,
    "source": "ga.elaws.us (public domain)"
  }
}